org/sass.org
#+TITLE:Introducción a Sass
#+AUTHOR: Patricio Martínez Cano
#+EMAIL: maxxcan@gmail.com
#+DATE: \today
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper, oneside]
#+LANGUAGE: es

#+latex_header:\textwidth=17cm
#+latex_header:\oddsidemargin=0.5cm

* Características

Sass (acrónimo de Syntactically Awesome StyleSheets) es una extensión de CSS que añade características muy potentes y elegantes a este lenguaje de estilos. Sass permite el uso de variables, reglas CSS anidadas, mixins, importación de hojas de estilos y muchas otras características, al tiempo que mantiene la compatibilidad con CSS.

Sass permite organizar mejor las hojas de estilos grandes y permite ser mucho más productivo con las hojas de estilos pequeñas, sobre todo gracias a la librería [[http://compass-style.org/][compass]].

En definitiva, Sass incluye las siguientes características:

+ 100% compatible con CSS3.
+ Permite el uso de variables, anidamiento de estilos y /mixins/.
+ Incluye numerosas funciones para manipular con facilidad colores y otros valores.
+ Permite el uso de elementos básicos de programación como las directivas de control y las librerías.
+ Genera archivos CSS bien formateados y permite configurar su formato.

* Sintaxis

Sass permite el uso de dos sintaxis diferentes para crear sus archivos. La primera, conocida como SCSS (del inglés, Sassy CSS) es la que vamos a utilizar en este manual y es una extensión de la sintaxis de CSS3. Esto significa que cualquier hoja de estilos CSS3 válida también es un archivo SCSS válido.

La segunda sintaxis, conocida como "sintaxis indentada" o simplemente "sintaxis sass" permite escribir los estilos CSS de manera más concisa. En este caso, el anidamiento de selectores se indica con tabulaciones en vez de con llaves y las propiedades se separan con saltos de línea en vez de con puntos y coma.

Algunos diseñadores consideran que esta segunda sintaxis es más sencilla de leer y más rápida de escribir que SCSS. En cualquier caso, las dos sintaxis tienen exactamente las mismas funcionalidades y sólo se diferencia en su sintaxis. Los archivos creados con esta segunda sintaxis utilizan la extensión .sass.

Una de las ventajas de Sass es que los archivos creados con una sintaxis pueden importar cualquier archivo creado con la otra sintaxis. Además, dispones de una utilidad para la línea de comandos que te permite convertir una sintaxis en otra:

#+begin_src sh

sass-convert estilos.sass estilos.scss

sass-convert estilos.scss estilos.sass

#+end_src

* Usando Sass

Sass se puede usar de tres maneras diferentes:

1. En la consola de comandos
2. Como un módulo de Ruby
3. Como un plugin de cualquier /framework/ compatible con Rack

Independientemente de cómo lo utilices, el primer paso siempre consiste en instalar Sass con el siguiente comando:

#+begin_src sh
gem install sass
#+end_src

Si utilizas Windows, es posible que primero tengas que [[https://rubyinstaller.org/][instalar Ruby]].

Para utilizar Sass en la línea de comandos, simplemente ejecuta el comando sass:

#+begin_src sh
sass hoja_estilos.scss archivo_generado.css
#+end_src

Si lo prefieres, también puedes añadir la opción --watch para decirle a Sass que vuelva a generar el archivo CSS cada vez que se cambie la hoja de estilos original:

#+begin_src sh
sass --watch hoja_estilos.scss:archivo_generdo.css
#+end_src

Si dispones de un directorio con muchos archivos Sass, también puedes vigilarlos todos por si se producen cambios en alguno de ellos:

#+begin_src sh
sass --watch app/sass:public/stylesheets
#+end_src

* Extensiones CSS

