doc/html/sass.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-27 jue 10:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Patricio Martínez Cano" />
<link rel="stylesheet" type="text/css" href="themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc8a05a3">Características</a></li>
<li><a href="#org8763131">Sintaxis</a></li>
<li><a href="#org70a6646">Usando Sass</a></li>
<li><a href="#orgd8cafd5">Extensiones CSS</a>
<ul>
<li><a href="#orgfe501ea">Reglas anidadas</a></li>
<li><a href="#org6f53f43">Refinando a los selectores padre</a></li>
<li><a href="#org6ec78d5">Propiedades anidadas</a></li>
<li><a href="#org73b097c">Selectores variables</a></li>
</ul>
</li>
<li><a href="#org923d231">Comentarios</a></li>
<li><a href="#org2552a88">SassScript</a>
<ul>
<li><a href="#org6c83c0f">Shell interactiva</a></li>
<li><a href="#org2e3a771">Variables</a></li>
<li><a href="#orgec3b31b">Tipos de datos</a></li>
<li><a href="#orgd5c8e0e">Cadenas de texto</a></li>
<li><a href="#org2ce491c">Listas</a></li>
<li><a href="#org394f6ad">Mapas</a></li>
<li><a href="#org9e80724">Operadores</a>
<ul>
<li><a href="#orgf58fcf2">Operadores para números</a></li>
<li><a href="#org7817b23">Operadores para colores</a></li>
<li><a href="#org9795b35">Operadores para cadenas de texto</a></li>
<li><a href="#orgb67d97a">Operadores para valores lógicos o booleanos</a></li>
<li><a href="#org33223fd">Operadores para listas</a></li>
</ul>
</li>
<li><a href="#org63e841a">Paréntesis</a></li>
<li><a href="#org527a42b">Funciones</a>
<ul>
<li><a href="#org0a0f51a">Argumentos con nombre</a></li>
</ul>
</li>
<li><a href="#org4b72882">Interpolación</a></li>
<li><a href="#orgd24f768">Variables con valores por defecto</a></li>
</ul>
</li>
<li><a href="#org90f44ed">Reglas @ y directivas</a>
<ul>
<li><a href="#orga19ed68">La regla @import</a></li>
<li><a href="#orgfa6a364">Hojas de estilo parciales</a></li>
<li><a href="#orga1cf817">Anidando reglas @import</a></li>
<li><a href="#orgf2d0361">La regla @media</a></li>
<li><a href="#orgb184b7f">La regla @extend</a>
<ul>
<li><a href="#org72bf3e9">Funcionamiento interno</a></li>
<li><a href="#orga7b99d1">Extendiendo selectores complejos</a></li>
<li><a href="#orgc56d01e">Extendiendo de varios selectores</a></li>
<li><a href="#org3f5c6f9">Extendiendo a varios niveles</a></li>
<li><a href="#orgad2acfa">Secuencia de selectores</a></li>
<li><a href="#orgb2efcfe">Selectores exclusivos para reglas @extend</a></li>
<li><a href="#org7e5d3cb">La opción !optional</a></li>
<li><a href="#orgf7a5d27">Usando @extend en las directivas</a></li>
</ul>
</li>
<li><a href="#orgdd2946a">La regla @at-root</a>
<ul>
<li><a href="#org6409995">Modificando la regla @at-root con with y without</a></li>
</ul>
</li>
<li><a href="#org5771d55">La regla @debug</a></li>
<li><a href="#org671e491">La regla @warn</a></li>
</ul>
</li>
<li><a href="#orgadcb461">Directivas de control y expresiones</a>
<ul>
<li><a href="#org42e702f">La función if()</a></li>
<li><a href="#org306c919">La directiva @if</a></li>
<li><a href="#org024e330">La directiva @for</a></li>
<li><a href="#org30e1ace">La directiva @each</a>
<ul>
<li><a href="#org991a330">Asignación múltiple</a></li>
</ul>
</li>
<li><a href="#org9c165f0">La directiva @while</a></li>
</ul>
</li>
<li><a href="#org01c0b88">Directivas mixin</a>
<ul>
<li><a href="#org474107a">Definiendo mixins con la directiva @mixin</a></li>
<li><a href="#org8d6901c">Incluyendo mixins con @include</a></li>
<li><a href="#orga3dd9ed">Argumentos</a></li>
<li><a href="#orgd58a30b">Argumentos con nombre</a></li>
<li><a href="#org884c3f6">Argumentos variables</a></li>
<li><a href="#orgbd1bd81">Pasando bloques de contenidos a los mixins</a>
<ul>
<li><a href="#orgf09ed45">Contexto variables y bloques contenidos</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9f30160">Directivas de función</a></li>
<li><a href="#org1049e80">Formato de salida</a>
<ul>
<li><a href="#org1d61419">Formato :nested</a></li>
<li><a href="#org13f9301">El formato :expanded</a></li>
<li><a href="#org76696a7">El formato :compact</a></li>
<li><a href="#org37c8f9c">El formato :compressed</a></li>
</ul>
</li>
<li><a href="#org5918c1d">Extendiendo Sass</a>
<ul>
<li><a href="#org49628eb">Definiendo funciones propias para Sass</a></li>
<li><a href="#org49df0aa">Sistemas de caché</a></li>
<li><a href="#orgc9173f8">Importadores propios</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Introducción a Sass
</p>

<div id="outline-container-orgc8a05a3" class="outline-2">
<h2 id="orgc8a05a3">Características</h2>
<div class="outline-text-2" id="text-orgc8a05a3">
<p>
Sass (acrónimo de Syntactically Awesome StyleSheets) es una extensión de CSS que añade características muy potentes y elegantes a este lenguaje de estilos. Sass permite el uso de variables, reglas CSS anidadas, mixins, importación de hojas de estilos y muchas otras características, al tiempo que mantiene la compatibilidad con CSS.
</p>

<p>
Sass permite organizar mejor las hojas de estilos grandes y permite ser mucho más productivo con las hojas de estilos pequeñas, sobre todo gracias a la librería <a href="http://compass-style.org/">compass</a>.
</p>

<p>
En definitiva, Sass incluye las siguientes características:
</p>

<ul class="org-ul">
<li>100% compatible con CSS3.</li>
<li>Permite el uso de variables, anidamiento de estilos y <i>mixins</i>.</li>
<li>Incluye numerosas funciones para manipular con facilidad colores y otros valores.</li>
<li>Permite el uso de elementos básicos de programación como las directivas de control y las librerías.</li>
<li>Genera archivos CSS bien formateados y permite configurar su formato.</li>
</ul>
</div>
</div>

<div id="outline-container-org8763131" class="outline-2">
<h2 id="org8763131">Sintaxis</h2>
<div class="outline-text-2" id="text-org8763131">
<p>
Sass permite el uso de dos sintaxis diferentes para crear sus archivos. La primera, conocida como SCSS (del inglés, Sassy CSS) es la que vamos a utilizar en este manual y es una extensión de la sintaxis de CSS3. Esto significa que cualquier hoja de estilos CSS3 válida también es un archivo SCSS válido.
</p>

<p>
La segunda sintaxis, conocida como "sintaxis indentada" o simplemente "sintaxis sass" permite escribir los estilos CSS de manera más concisa. En este caso, el anidamiento de selectores se indica con tabulaciones en vez de con llaves y las propiedades se separan con saltos de línea en vez de con puntos y coma.
</p>

<p>
Algunos diseñadores consideran que esta segunda sintaxis es más sencilla de leer y más rápida de escribir que SCSS. En cualquier caso, las dos sintaxis tienen exactamente las mismas funcionalidades y sólo se diferencia en su sintaxis. Los archivos creados con esta segunda sintaxis utilizan la extensión .sass.
</p>

<p>
Una de las ventajas de Sass es que los archivos creados con una sintaxis pueden importar cualquier archivo creado con la otra sintaxis. Además, dispones de una utilidad para la línea de comandos que te permite convertir una sintaxis en otra:
</p>

<div class="org-src-container">
<pre class="src src-sh">sass-convert estilos.sass estilos.scss

sass-convert estilos.scss estilos.sass

</pre>
</div>
</div>
</div>

<div id="outline-container-org70a6646" class="outline-2">
<h2 id="org70a6646">Usando Sass</h2>
<div class="outline-text-2" id="text-org70a6646">
<p>
Sass se puede usar de tres maneras diferentes:
</p>

<ol class="org-ol">
<li>En la consola de comandos</li>
<li>Como un módulo de Ruby</li>
<li>Como un plugin de cualquier <i>framework</i> compatible con Rack</li>
</ol>

<p>
Independientemente de cómo lo utilices, el primer paso siempre consiste en instalar Sass con el siguiente comando:
</p>

<div class="org-src-container">
<pre class="src src-sh">gem install sass
</pre>
</div>

<p>
Si utilizas Windows, es posible que primero tengas que <a href="https://rubyinstaller.org/">instalar Ruby</a>.
</p>

<p>
Para utilizar Sass en la línea de comandos, simplemente ejecuta el comando sass:
</p>

<div class="org-src-container">
<pre class="src src-sh">sass hoja_estilos.scss archivo_generado.css
</pre>
</div>

<p>
Si lo prefieres, también puedes añadir la opción &#x2013;watch para decirle a Sass que vuelva a generar el archivo CSS cada vez que se cambie la hoja de estilos original:
</p>

<div class="org-src-container">
<pre class="src src-sh">sass --watch hoja_estilos.scss:archivo_generdo.css
</pre>
</div>

<p>
Si dispones de un directorio con muchos archivos Sass, también puedes vigilarlos todos por si se producen cambios en alguno de ellos:
</p>

<div class="org-src-container">
<pre class="src src-sh">sass --watch app/sass:public/stylesheets
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8cafd5" class="outline-2">
<h2 id="orgd8cafd5">Extensiones CSS</h2>
