doc/html/sass.html
<div class="outline-text-2" id="text-orgd8cafd5">
</div><div id="outline-container-orgfe501ea" class="outline-3">
<h3 id="orgfe501ea">Reglas anidadas</h3>
<div class="outline-text-3" id="text-orgfe501ea">
<p>
Sass permite anidar las reglas CSS para que las hojas de estilos sean más concisas y fáciles de escribir. A los selectores anidados se les prefija automáticamente todos los selectores de los niveles superiores. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#main p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-2">#00ff00</span>;
  <span class="org-css-property">width</span>: 97%;

  <span class="org-css-selector">.redbox </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">background-color</span>: <span class="custom-1">#ff0000</span>;
    <span class="org-css-property">color</span>: <span class="custom">#000000</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>


<p>
El código Sass anterior se convierte automáticamente en el siguiente código CSS:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-2">#00ff00</span>;
  <span class="org-css-property">width</span>: 97%;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main p .redbox </span><span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-css-property">background-color</span>: <span class="custom-1">#ff0000</span>;
    <span class="org-css-property">color</span>: <span class="custom">#000000</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Gracias a las reglas anidadas, se evita tener que repetir una y otra vez los mismos selectores y se simplifica enormemente la creación de hojas de estilos complejas. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 97%;

  <span class="org-css-selector">p, div </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">font-size</span>: 2em;
    <span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-3">{</span> <span class="org-css-property">font-weight</span>: bold; <span class="org-rainbow-delimiters-depth-3">}</span>
  <span class="org-rainbow-delimiters-depth-2">}</span>

  <span class="org-css-selector">pre </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">font-size</span>: 3em; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
El código Sass anterior se transforma en el siguiente código CSS:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 97%;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main p, #main div </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 2em;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main p a, #main div a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main pre </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 3em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f53f43" class="outline-3">
<h3 id="org6f53f43">Refinando a los selectores padre</h3>
<div class="outline-text-3" id="text-org6f53f43">
<p>
En ocasiones es necesario modificar el comportamiento por defecto de los selectores anidados. Imagina que quieres aplicar estilos especiales en el estado hover del selector o cuando el elemento &lt;body&gt; de la página tiene una determinada clase.
</p>

<p>
En estos casos, puedes utilizar el carácter &amp; para hacer referencia al selector padre dentro del cual se encuentra la regla anidada. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">text-decoration</span>: none;
  <span class="org-css-selector">&amp;:hover </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">text-decoration</span>: underline; <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-css-selector">body.firefox &amp; </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">font-weight</span>: normal; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código sass anterior se compilará a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">text-decoration</span>: none;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">a:hover </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">text-decoration</span>: underline;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">body.firefox a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: normal;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
El carácter especial &amp; siempre se reemplaza por el selector padre tal y como aparece en el archivo CSS. Esto significa que si tiene una regla anidada, primero se calcula el selector padre completo y después se reemplaza por &amp;. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">black</span>;
  <span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">font-weight</span>: bold;
    <span class="org-css-selector">&amp;:hover </span><span class="org-rainbow-delimiters-depth-3">{</span> <span class="org-css-property">color</span>: <span class="custom">red</span>; <span class="org-rainbow-delimiters-depth-3">}</span>
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">black</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main a:hover </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">red</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El carácter &amp; siempre debe aparecer al principio de los selectores compuestos, pero sí que puede ir seguido de un sufijo que se aplicará al selector padre. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">black</span>;
  <span class="org-css-selector">&amp;-sidebar </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">border</span>: 1px solid; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">black</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main-sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px solid;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si por cualquier circunstancia no se puede aplicar el sufijo al selector padre, Sass mostrará un mensaje de error indicándote la causa.
</p>
</div>
</div>
