org/sass.org
** Propiedades anidadas

CSS define varias propiedades cuyos nombres paracen estar agrupados de forma lógica. Así por ejemplo, las propiedades font-family, font-size y font-weight están todas relacionadas con el grupo font. En CSS es obligatorio escribir el nombre completo de todas estas propiedades. Sass permite utilizar el siguiente atajo para definir las propiedades relacionadas:

#+begin_src scss
.funky {
  font: {
    family: fantasy;
    size: 30em;
    weight: bold;
  }
}
#+end_src

El código Sass anterior se compila de la siguiente manera:

#+begin_src css
.funky {
  font-family: fantasy;
  font-size: 30em;
  font-weight: bold;
}
#+end_src

También es posible aplicar un valor al propio nombre que agrupa las propiedades:

#+begin_src scss
.funky {
  font: 2px/3px {
    family: fantasy;
    size: 30em;
    weight: bold;
  }
}
#+end_src

El código Sass anterior se compila de la siguiente manera:

#+begin_src css
.funky {
  font: 2px/3px;
  font-family: fantasy;
  font-size: 30em;
  font-weight: bold;
}
#+end_src

** Selectores variables

Sass también soporta un tipo especial de selector variable que se parece a los selectores de clase o de ID, pero que utiliza % en vez de # o .. No obstante, estos selectores variables solamente deberían usarse con la directiva @extend, tal y como se explica en los siguientes capítulos.

Si utilizas estos selectores sin la directiva @extend, el archivo CSS generado ignorará todas esas reglas Sass.

* Comentarios

Sass soporta el mismo tipo de comentarios que CSS, que utilizan los delimitadores /* y */ y pueden ocupar una o más líneas. Además, Sass también soporta los comentarios de una única línea que utilizan los delimitadores // y que son muy comunes en todos los lenguajes de programación.

La principal diferencia entre estos dos tipos de comentarios es que los comentarios tradicionales (/* ... */) se añaden en el código CSS generado, mientras que los comentarios de una sola línea (// ...) se eliminan y no aparecen en el código CSS generado. Ejemplo:

#+begin_src scss

/* Este comentario ocupa varias líneas,
 * y utiliza el formato tradicional de CSS.
 * Su contenido aparecerá en el archivo CSS compilado. */
body { color: black; }

#+end_src

El código Sass anterior se compila de la siguiente manera:

#+begin_src css
/* Este comentario ocupa varias líneas,
 * y utiliza el formato tradicional de CSS.
 * Su contenido aparecerá en el archivo CSS compilado. */
body {
    color: black;
}
 
a {
    color: green;
}
#+end_src

Cuando la primera letra de un comentario de una sola línea es !, su contenido siempre se incluye en el archivo CSS compilado. Esto es útil por ejemplo para mantener mensajes como el Copyright de tus hojas de estilos.

* SassScript

Además de extender la sintaxis básica de CSS, Sass incluye una serie de extensiones más avanzadas llamadas SassScript. Gracias a estas extensiones, las propiedades pueden utilizar variables, expresiones matemáticas y otras funciones. Sass permite el uso de SassScript para definir cualquier valor de cualquier propiedad.

** Shell interactiva

Si quieres experimentar con SassScript antes de empezar a utilizarlo en tus hojas de estilos, puedes hacer uso de "la shell interactiva". Para ello, ejecuta el comando sass añadiendo la opción -i y escribe cualquier expresión válida de SassScript. La shell te mostrará el resultado de evaluar esa expresión o un mensaje de error si no es correcta:

#+begin_src sh
$ sass -i
>> "¡Hola Mundo!"
"¡Hola Mundo!"
 
>> 1px + 1px + 1px
3px
 
>> #777 + #777
#eeeeee
 
>> #777 + #888
white
#+end_src

** Variables

La funcionalidad básica de SassScript es el uso de variables para almacenar valores que utilizas una y otra vez en tus hojas de estilos. Para ello, utiliza cualquier palabra como nombre de la variable, añádele el símbolo $ por delante y establece su valor como si fuera una propiedad CSS normal. Si por ejemplo defines una variable de la siguiente manera:

#+begin_src scss
$anchura: 5em;
#+end_src

Ahora ya puedes utilizar la variable llamada $width como valor de cualquier propiedad CSS:

#+begin_src scss
#main {
  width: $anchura;
}
#+end_src


Una limitación importante de las variables es que sólo están disponibles dentro del contexto donde se han definido. Esto significa que si defines la variable dentro de una regla anidada, sólo estará disponible para esas reglas anidadas. Si quieres poder utilizar una variable como valor de cualquier propiedad de la hoja de estilos, defínela fuera de cualquier selector.

** Tipos de datos

SassScript soporta seis tipos de datos:

+ Numeros
+ Cadenas de texto con o sin comillas simples o dobles
+ Colores
+ Valores lógicos o booleanos
+ Valores nulos (null)
+ Lista de valores, separados por espacios en blanco o comas
+ Pares formados por una clave y un valor separado por :

SassScript también soporta todos los otros tipos de datos soportados por CSS, como por ejemplo los caracteres Unicode o la palabra reservada !important. No obstante, Sass no trata estos valores de manera especial y se limita a considerarlos como si fuera una cadena de texto normal y corriente.

