doc/html/sass.html

<div id="outline-container-org6ec78d5" class="outline-3">
<h3 id="org6ec78d5">Propiedades anidadas</h3>
<div class="outline-text-3" id="text-org6ec78d5">
<p>
CSS define varias propiedades cuyos nombres paracen estar agrupados de forma lógica. Así por ejemplo, las propiedades font-family, font-size y font-weight están todas relacionadas con el grupo font. En CSS es obligatorio escribir el nombre completo de todas estas propiedades. Sass permite utilizar el siguiente atajo para definir las propiedades relacionadas:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.funky </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">family</span>: fantasy;
    <span class="org-css-property">size</span>: 30em;
    <span class="org-css-property">weight</span>: bold;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.funky </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-family</span>: fantasy;
  <span class="org-css-property">font-size</span>: 30em;
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
También es posible aplicar un valor al propio nombre que agrupa las propiedades:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.funky </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: 2px/3px <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">family</span>: fantasy;
    <span class="org-css-property">size</span>: 30em;
    <span class="org-css-property">weight</span>: bold;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.funky </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: 2px/3px;
  <span class="org-css-property">font-family</span>: fantasy;
  <span class="org-css-property">font-size</span>: 30em;
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73b097c" class="outline-3">
<h3 id="org73b097c">Selectores variables</h3>
<div class="outline-text-3" id="text-org73b097c">
<p>
Sass también soporta un tipo especial de selector variable que se parece a los selectores de clase o de ID, pero que utiliza % en vez de # o .. No obstante, estos selectores variables solamente deberían usarse con la directiva @extend, tal y como se explica en los siguientes capítulos.
</p>

<p>
Si utilizas estos selectores sin la directiva @extend, el archivo CSS generado ignorará todas esas reglas Sass.
</p>
</div>
</div>
</div>

<div id="outline-container-org923d231" class="outline-2">
<h2 id="org923d231">Comentarios</h2>
<div class="outline-text-2" id="text-org923d231">
<p>
Sass soporta el mismo tipo de comentarios que CSS, que utilizan los delimitadores <i>* y *</i> y pueden ocupar una o más líneas. Además, Sass también soporta los comentarios de una única línea que utilizan los delimitadores // y que son muy comunes en todos los lenguajes de programación.
</p>

<p>
La principal diferencia entre estos dos tipos de comentarios es que los comentarios tradicionales (<i>* &#x2026; *</i>) se añaden en el código CSS generado, mientras que los comentarios de una sola línea (// &#x2026;) se eliminan y no aparecen en el código CSS generado. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-comment-delimiter">/* </span><span class="org-comment">Este comentario ocupa varias l&#237;neas,</span>
<span class="org-comment"> * y utiliza el formato tradicional de CSS.</span>
<span class="org-comment"> * Su contenido aparecer&#225; en el archivo CSS compilado. */</span>
<span class="org-css-selector">body </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">color</span>: <span class="custom">black</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-comment-delimiter">/* </span><span class="org-comment">Este comentario ocupa varias l&#237;neas,</span>
<span class="org-comment"> * y utiliza el formato tradicional de CSS.</span>
<span class="org-comment"> * Su contenido aparecer&#225; en el archivo CSS compilado. </span><span class="org-comment-delimiter">*/</span>
<span class="org-css-selector">body </span><span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-css-property">color</span>: <span class="custom-1">black</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-css-property">color</span>: <span class="custom">green</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Cuando la primera letra de un comentario de una sola línea es !, su contenido siempre se incluye en el archivo CSS compilado. Esto es útil por ejemplo para mantener mensajes como el Copyright de tus hojas de estilos.
</p>
</div>
</div>

<div id="outline-container-org2552a88" class="outline-2">
<h2 id="org2552a88">SassScript</h2>
<div class="outline-text-2" id="text-org2552a88">
<p>
Además de extender la sintaxis básica de CSS, Sass incluye una serie de extensiones más avanzadas llamadas SassScript. Gracias a estas extensiones, las propiedades pueden utilizar variables, expresiones matemáticas y otras funciones. Sass permite el uso de SassScript para definir cualquier valor de cualquier propiedad.
</p>
</div>

<div id="outline-container-org6c83c0f" class="outline-3">
<h3 id="org6c83c0f">Shell interactiva</h3>
<div class="outline-text-3" id="text-org6c83c0f">
<p>
Si quieres experimentar con SassScript antes de empezar a utilizarlo en tus hojas de estilos, puedes hacer uso de "la shell interactiva". Para ello, ejecuta el comando sass añadiendo la opción -i y escribe cualquier expresión válida de SassScript. La shell te mostrará el resultado de evaluar esa expresión o un mensaje de error si no es correcta:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ sass -i
&gt;&gt; <span class="org-string">"&#161;Hola Mundo!"</span>
<span class="org-string">"&#161;Hola Mundo!"</span>

&gt;&gt; 1px + 1px + 1px
3px

&gt;&gt; <span class="org-comment-delimiter">#</span><span class="org-comment">777 + #777</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">eeeeee</span>

&gt;&gt; <span class="org-comment-delimiter">#</span><span class="org-comment">777 + #888</span>
white
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e3a771" class="outline-3">
<h3 id="org2e3a771">Variables</h3>
<div class="outline-text-3" id="text-org2e3a771">
<p>
La funcionalidad básica de SassScript es el uso de variables para almacenar valores que utilizas una y otra vez en tus hojas de estilos. Para ello, utiliza cualquier palabra como nombre de la variable, añádele el símbolo $ por delante y establece su valor como si fuera una propiedad CSS normal. Si por ejemplo defines una variable de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$width</span>: 5em;
</pre>
</div>

<p>
Ahora ya puedes utilizar la variable llamada $width como valor de cualquier propiedad CSS:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: <span class="org-variable-name">$width</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>


<p>
Una limitación importante de las variables es que sólo están disponibles dentro del contexto donde se han definido. Esto significa que si defines la variable dentro de una regla anidada, sólo estará disponible para esas reglas anidadas. Si quieres poder utilizar una variable como valor de cualquier propiedad de la hoja de estilos, defínela fuera de cualquier selector.
</p>
</div>
</div>

<div id="outline-container-orgec3b31b" class="outline-3">
<h3 id="orgec3b31b">Tipos de datos</h3>
<div class="outline-text-3" id="text-orgec3b31b">
<p>
SassScript soporta seis tipos de datos:
</p>

<ul class="org-ul">
<li>Numeros</li>
<li>Cadenas de texto con o sin comillas simples o dobles</li>
<li>Colores</li>
<li>Valores lógicos o booleanos</li>
<li>Valores nulos (null)</li>
<li>Lista de valores, separados por espacios en blanco o comas</li>
<li>Pares formados por una clave y un valor separado por :</li>
</ul>

<p>
SassScript también soporta todos los otros tipos de datos soportados por CSS, como por ejemplo los caracteres Unicode o la palabra reservada !important. No obstante, Sass no trata estos valores de manera especial y se limita a considerarlos como si fuera una cadena de texto normal y corriente.
</p>
</div>
</div>
