doc/html/sass.html

<div id="outline-container-orgd5c8e0e" class="outline-3">
<h3 id="orgd5c8e0e">Cadenas de texto</h3>
<div class="outline-text-3" id="text-orgd5c8e0e">
<p>
CSS define dos tipos de cadenas de texto: las que tienen comillas (dobles o simples) como por ejemplo "Lucida Grande" o 'http://sass-lang.com'; y las que no tienen comillas, como por ejemplo sans-serif o bold.
</p>

<p>
SassScript soporta y reconoce estos dos tipos de cadenas. En general, el archivo CSS compilado mantendrá el mismo tipo de cadena que el que se utilizó en el archivo Sass original.
</p>

<p>
La única excepción es cuando se utiliza la interpolación #{} que se explica en los próximos capítulos. En este caso, las cadenas siempre se generan sin comillas. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">firefox-message</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$selector</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">body.firefox #</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">{</span></span><span class="org-variable-name">$selector</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">}</span></span><span class="org-css-selector">:before </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">content</span>: <span class="org-string">"Hi, Firefox users!"</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-builtin">@include</span> firefox-message<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">".header"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
El código Sass anterior se compila a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">body.firefox .header:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"Hi, Firefox users!"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org2ce491c" class="outline-3">
<h3 id="org2ce491c">Listas</h3>
<div class="outline-text-3" id="text-org2ce491c">
<p>
Las listas son el tipo de dato que utiliza Sass para representar los valores que normalmente se utilizan en las propiedades CSS como margin: 10px 15px 0 0 o font-face: Helvetica, Arial, sans-serif. Las listas son simplemente una colección de valores separados por comas o espacios en blanco. Técnicamente, cada elemento de la lista también se considera una lista simple de un solo elemento.
</p>

<p>
Por si solas las listas no sirven para mucho, pero gracias a las funciones para listas definidas por SassScript que se explican en los siguientes capítulos, puedes conseguir resultados muy avanzados. La función nth() por ejemplo permite acceder al enésimo elemento de una lista, la función join() puede concatenar todos los valores y la función append() puede fusionar varias listas en una sola. Por último, la directiva @each permite aplicar estilos a cada elemento de una lista.
</p>

<p>
Además de contener valores simples, las listas pueden contener en su interior otras listas. Así por ejemplo, la lista 1px 2px, 5px 6px es una lista de dos elementos, que a su vez son las listas 1px 2px y 5px 6px. Si las listas interiores utilizan el mismo carácter para separar sus elementos que la lista principal, puedes añadir paréntesis para indicar claramente cuáles son los elementos de las listas anidadas. Así por ejemplo, la lista (1px 2px) (5px 6px) también es una lista de dos elementos cuyos valores son a su vez dos listas con los valores 1px 2px y 5px 6px.
</p>

<p>
Cuando se genera el archivo CSS, Sass no mantiene los paréntesis de las listas porque CSS no es capaz de entenderlos. Así que los valores (1px 2px) (5px 6px) y 1px 2px 5px 6px de Sass generan el mismo código cuando se compilan a CSS. No obstante, en Sass estos dos valores son diferentes: el primero es una lista que tiene dos listas en su interior y el segundo es una lista de cuatro números.
</p>

<p>
Las listas también pueden estar vacías y no contener ningún elemento. Estas listas vacías se representan mediante () y no se pueden incluir directamente en el archivo CSS compilado. Así que si defines una regla como font-family: (), Sass mostrará un mensaje de error. Si una lista contiene valores vacíos o nulos, como por ejemplo 1px 2px () 3px o 1px 2px null 3px, estos valores se eliminan antes de convertir la lista a código CSS.
</p>


<p>
Las listas separadas por comas pueden incluir una coma después del último elemento. Esto es muy útil por ejemplo para crear listas de un solo elemento. Así por ejemplo (1,) es una lista que contiene el elemento 1, mientras que (1 2 3,) es una lista separada por comas cuyo primer elemento es a su vez una lista separada por espacios en blanco y que contiene los elementos 1, 2 y 3.
</p>
</div>
</div>

<div id="outline-container-org394f6ad" class="outline-3">
<h3 id="org394f6ad">Mapas</h3>
<div class="outline-text-3" id="text-org394f6ad">
<p>
Los mapas son asociaciones de claves y valores. La clave se utiliza para acceder fácilmente al valor de cualquier elemento del mapa. Se utilizan principalmente para agrupar valores y acceder a ellos dinámicamente. En CSS no existe ningún elemento equivalente a los mapas, pero su sintaxis es similar a las expresiones media query:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$map</span>: <span class="org-rainbow-delimiters-depth-1">(</span>clave1: valor1, clave2: valor2, clave3: valor3<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
A diferencia de las listas, los mapas siempre se encierran con paréntesis y los pares clave: valor deben separarse con comas. Tanto las claves como los valores de los mapas pueden utilizar cualquier función o expresión de SassScript. Las claves de un mapa deben ser únicas, por lo que si quieres asociar varios valores a una misma clave, debes utilizar una lista.
</p>

<p>
Al igual que sucede con las listas, los mapas se pueden manipular mediante funciones de SassScript. La función map-get() por ejemplo busca un valor dentro del mapa a partir de la clave indicada y la función map<sub>merge</sub>() añade nuevos pares clave: valor a un mapa existente. Además, la directiva @each se puede emplear para aplicar estilos a cada par clave: valor de un mapa.
</p>

<p>
Los mapas también se pueden utilizar en cualquier función preparada para manipular listas. Si pasas un mapa a una función que espera una lista, el mapa se transforma primero en un lista de pares de valores. Así por ejemplo, si pasas el mapa (clave1: valor1, clave2: valor2) a una función para listas, este se transforma automáticamente en clave1 valor1, clave2 valor2. Lo contrario no es cierto, ya que no puedes utilizar listas en las funciones preparadas para mapas. La única excepción es la lista vacía (), que representa tanto a un mapa vacío como a una lista vacía.
</p>

<p>
Los mapas no se pueden convertir directamente a código CSS. Por tanto, si utilizar un mapa como valor de una variable o como argumento de una función CSS, Sass mostrará un mensaje de error.
</p>
</div>
</div>

<div id="outline-container-org9e80724" class="outline-3">
<h3 id="org9e80724">Operadores</h3>
<div class="outline-text-3" id="text-org9e80724">
<p>
Todos los tipos de datos soportan el operador de igualdad (<code>= y !</code>) para comprobar si dos valores son iguales o distintos. Además, cada tipo de dato define otros operadores propios.
</p>
</div>

<div id="outline-container-orgf58fcf2" class="outline-4">
<h4 id="orgf58fcf2">Operadores para números</h4>
<div class="outline-text-4" id="text-orgf58fcf2">
<p>
SassScript soporta los cinco operadores aritméticos básicos: suma +, resta -, multiplicación *, división / y módulo %. El operador módulo calcula el resto de la división sin decimales (ejemplo: 5 módulo 2 = 1, % % 2 = 1). Además, si realizas operaciones sobre números con diferentes unidades, Sass convertirá automáticamente las unidades siempre que sea posible:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 1in + 8pt;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código css resultante será:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 1.111in;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Con los números también se pueden utilizar los operadores relacionales (&lt;, &gt;, &lt;=, &gt;=) y los de igualdad (<code>=, !</code>).
</p>
</div>
