org/sass.org
**** El problema del carácter / con la división de números

CSS permite el uso del carácter / para separar números. Como Sass es totalmente compatible con la sintaxis de CSS, debe soportar el uso de esta característica. El problema es que el carácter / también se utiliza para la operación matemática de dividir números. Por todo esto, si utilizas el carácter / para separar dos números en SassScript, en el archivo CSS compilado aparecerán tal cual los has escrito.

No obstante, existen tres situaciones en las que el carácter / siempre se interpreta como una división matemática:

1. Si uno de los operandos de la división es una variable o el resultado devuelto por una función.
2. Si el valor está encerrado entre paréntesis.
3. Si el valor se utiliza como parte de una expresión matemática.

Ejemplo:

#+begin_src scss
p {
  // El carácter '/' se interpreta como código CSS normal
  font: 10px/8px;
  $width: 1000px;
 
  // El carácter '/'  se interpreta como una división
  width: $width/2;        // Uno de los operandos es una variable
  width: round(1.5)/2;    // Uno de los operados es el resultado de una función
  height: (500px/2);      // Los parénteis encierran la expresión
  margin-left: 5px + 8px/2px; // El '+' indica que es una expresión matemática
}
#+end_src


El código css que genera es:

#+begin_src css
p {
  font: 10px/8px;
  width: 500px;
  height: 250px;
  margin-left: 9px;
}
#+end_src

Si quieres utilizar el carácter / normal de CSS incluso cuando empleas variables, encierra las variables con #{}. Ejemplo:

#+begin_src scss
p {
  $font-size: 12px;
  $line-height: 30px;
  font: #{$font-size}/#{$line-height};
}
#+end_src

El código css que genera es:

#+begin_src css
p {
  font: 12px/30px;
}
#+end_src

*** Operadores para colores

Los operadores aritméticos también se pueden aplicar a los valores que representan colores. En este caso, los cálculos siempre se realizan sobre cada componente del color. Esto significa que antes de cada operación, el color se descompone en sus tres componentes R, G y B, para después aplicar la operación a cada componente. Ejemplo:

#+begin_src scss
p {
  color: #010203 + #040506;
}
#+end_src

Las tres operaciones realizadas son 01 + 04 = 05, 02 + 05 = 07 y 03 + 06 = 09, por lo que el código CSS compilado resultante es:

#+begin_src css
p {
  color: #050709;
}
#+end_src

En la mayoría de los casos, es mejor utilizar las funciones especiales de SassScript para colores que se explicarán más adelante, en vez de realizar operaciones matemáticas sobre ellos.

Las operaciones matemáticas también se pueden realizar combinando colores y números. Ejemplo:

#+begin_src scss
p {
  color: #010203 * 2;
}
#+end_src

Las tres operaciones realizadas son 01 * 2 = 02, 02 * 2 = 04 y 03 * 2 = 06, por lo que el código CSS compilado resultante es:

#+begin_src css
p {
  color: #020406;
}
#+end_src

Si realizas operaciones sobre colores que incluyen un canal alpha (por ejemplo los que han sido creados con las funciones rgba() o hsla()) los dos colores deben tener el mismo valor alpha para poder realizar la operación con éxito. El motivo es que los cálculos no afectan al valor alpha. Ejemplo:

#+begin_src scss
p {
  color: rgba(255, 0, 0, 0.75) + rgba(0, 255, 0, 0.75);
}
#+end_src

El código CSS compilado resultante es:

#+begin_src css
p {
  color: rgba(255, 255, 0, 0.75);
}
#+end_src

El canal alpha de un color se puede ajustar con la función opacify() o transparentize(). Ejemplo:

#+begin_src scss
$translucent-red: rgba(255, 0, 0, 0.5);
 
p {
  color: opacify($translucent-red, 0.3);
  background-color: transparentize($translucent-red, 0.25);
}
#+end_src

El código Sass anterior se compila de la siguiente manera:

#+begin_src css
p {
  color: rgba(255, 0, 0, 0.8);
  background-color: rgba(255, 0, 0, 0.25);
}
#+end_src

