doc/html/sass.html

<ul class="org-ul"><li><a id="orge81d2f8"></a>El problema del carácter / con la división de números<br /><div class="outline-text-5" id="text-orge81d2f8">
<p>
CSS permite el uso del carácter / para separar números. Como Sass es totalmente compatible con la sintaxis de CSS, debe soportar el uso de esta característica. El problema es que el carácter / también se utiliza para la operación matemática de dividir números. Por todo esto, si utilizas el carácter / para separar dos números en SassScript, en el archivo CSS compilado aparecerán tal cual los has escrito.
</p>

<p>
No obstante, existen tres situaciones en las que el carácter / siempre se interpreta como una división matemática:
</p>

<ol class="org-ol">
<li>Si uno de los operandos de la división es una variable o el resultado devuelto por una función.</li>
<li>Si el valor está encerrado entre paréntesis.</li>
<li>Si el valor se utiliza como parte de una expresión matemática.</li>
</ol>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">El car&#225;cter '/' se interpreta como c&#243;digo CSS normal</span>
  <span class="org-css-property">font</span>: 10px/8px;
  <span class="org-variable-name">$width</span>: 1000px;

  <span class="org-comment-delimiter">// </span><span class="org-comment">El car&#225;cter '/'  se interpreta como una divisi&#243;n</span>
  <span class="org-css-property">width</span>: <span class="org-variable-name">$width</span>/2;        <span class="org-comment-delimiter">// </span><span class="org-comment">Uno de los operandos es una variable</span>
  <span class="org-css-property">width</span>: round<span class="org-rainbow-delimiters-depth-2">(</span>1.5<span class="org-rainbow-delimiters-depth-2">)</span>/2;    <span class="org-comment-delimiter">// </span><span class="org-comment">Uno de los operados es el resultado de una funci&#243;n</span>
  <span class="org-css-property">height</span>: <span class="org-rainbow-delimiters-depth-2">(</span>500px/2<span class="org-rainbow-delimiters-depth-2">)</span>;      <span class="org-comment-delimiter">// </span><span class="org-comment">Los par&#233;nteis encierran la expresi&#243;n</span>
  <span class="org-css-property">margin-left</span>: 5px + 8px/2px; <span class="org-comment-delimiter">// </span><span class="org-comment">El '+' indica que es una expresi&#243;n matem&#225;tica</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>


<p>
El código css que genera es:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: 10px/8px;
  <span class="org-css-property">width</span>: 500px;
  <span class="org-css-property">height</span>: 250px;
  <span class="org-css-property">margin-left</span>: 9px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si quieres utilizar el carácter / normal de CSS incluso cuando empleas variables, encierra las variables con #{}. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-variable-name">$font-size</span>: 12px;
  <span class="org-variable-name">$line-height</span>: 30px;
  <span class="org-css-property">font</span>: #<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">$font-size</span><span class="org-rainbow-delimiters-depth-2">}</span>/#<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">$line-height</span><span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código css que genera es:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: 12px/30px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-org7817b23" class="outline-4">
<h4 id="org7817b23">Operadores para colores</h4>
<div class="outline-text-4" id="text-org7817b23">
<p>
Los operadores aritméticos también se pueden aplicar a los valores que representan colores. En este caso, los cálculos siempre se realizan sobre cada componente del color. Esto significa que antes de cada operación, el color se descompone en sus tres componentes R, G y B, para después aplicar la operación a cada componente. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">#010203</span> + <span class="custom">#040506</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Las tres operaciones realizadas son 01 + 04 = 05, 02 + 05 = 07 y 03 + 06 = 09, por lo que el código CSS compilado resultante es:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">#050709</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
En la mayoría de los casos, es mejor utilizar las funciones especiales de SassScript para colores que se explicarán más adelante, en vez de realizar operaciones matemáticas sobre ellos.
</p>

<p>
Las operaciones matemáticas también se pueden realizar combinando colores y números. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">#010203</span> * 2;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Las tres operaciones realizadas son 01 * 2 = 02, 02 * 2 = 04 y 03 * 2 = 06, por lo que el código CSS compilado resultante es:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">#020406</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si realizas operaciones sobre colores que incluyen un canal alpha (por ejemplo los que han sido creados con las funciones rgba() o hsla()) los dos colores deben tener el mismo valor alpha para poder realizar la operación con éxito. El motivo es que los cálculos no afectan al valor alpha. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">rgba(255, 0, 0, 0.75)</span> + <span class="custom">rgba(0, 255, 0, 0.75)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código CSS compilado resultante es:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">rgba(255, 255, 0, 0.75)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El canal alpha de un color se puede ajustar con la función opacify() o transparentize(). Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$translucent-red</span>: <span class="custom">rgba(255, 0, 0, 0.5)</span>;

<span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: opacify<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$translucent-red</span>, 0.3<span class="org-rainbow-delimiters-depth-2">)</span>;
  <span class="org-css-property">background-color</span>: transparentize<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$translucent-red</span>, 0.25<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">rgba(255, 0, 0, 0.8)</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">rgba(255, 0, 0, 0.25)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
