org/sass.org
*** Operadores para cadenas de texto


El operador + se puede utilizar para concatenar dos o más cadenas de texto:

#+begin_src scss
p {
  cursor: e + -resize;
}

#+end_src

El código css resultantes será:

#+begin_src css
p {
  cursor: e-resize;
}
#+end_src

Si la cadena que está a la izquierda del operador + está encerrada por comillas, el resultado de la operación será una cadena con comillas. Igualmente, si la cadena de la izquierda no tiene comillas, el resultado será una cadena sin comillas. Ejemplo:

#+begin_src scss
p:before {
  content: "Foo " + Bar;
  font-family: sans- + "serif";
}
#+end_src

El código css resultante:

#+begin_src css
p:before {
  content: "Foo Bar";
  font-family: sans-serif;
}
#+end_src

Por defecto, si dos valores son contiguos, se concatenan con un espacio en blanco:

#+begin_src scss
p {
  margin: 3px + 4px auto;
}
#+end_src

Esto dará el siguiente css:

#+begin_src css
p {
  margin: 7px auto;
}
#+end_src

Dentro de una cadena de texto puedes utilizar la sintaxis #{ } para realizar operaciones matemáticas o para evaluar expresiones antes de incluirlas en la cadena. Esta característica se llama "*interpolación de cadenas de texto*":

#+begin_src scss
p:before {
  content: "¡Me he comido #{5 + 10} pasteles!";
}
#+end_src

El código css resultante:

#+begin_src css
p:before {
  content: "¡Me he comido 15 pasteles!";
}
#+end_src

Cuando interpolas una cadena de texto, los valores nulos se consideran cadenas vacías:

#+begin_src scss
$value: null;
 
p:before {
  content: "¡Me he comido #{$valor} pasteles!";
}
#+end_src

Esto dará:

#+begin_src css
p:before {
  content: "¡Me he comido pasteles!";
}
#+end_src

*** Operadores para valores lógicos o booleanos

SassScript soporta el uso de los tradicionales operadores and, or y not sobre los valores lógicos o booleanos.

*** Operadores para listas

Sass no define ningún operador específico para las listas de elementos, ya que estas se manipulan mediante las funciones especiales que se explican en los siguientes capítulos.

** Paréntesis

Puedes añadir paréntesis a cualquier expresión Sass para afectar al orden en el que se realizan las operaciones:

#+begin_src scss
p {
  width: 1em + (2em * 3);
}
#+end_src

El código Sass se compila:

#+begin_src css
p {
  width: 7em;
}
#+end_src

** Funciones

SassScript define algunas funciones muy útiles para crear las hojas de estilos y que utilizan la misma sintaxis que CSS:

#+begin_src scss
p {
  color: hsl(0, 100%, 50%);
}
#+end_src

Esto se compila:

#+begin_src css
p {
  color: #ff0000;
}
#+end_src

*** Argumentos con nombre

Para que su uso sea más flexible, a las funciones de Sass les puedes pasar argumentos con nombre. De esta manera no es obligatorio respetar el orden en el que se definieron los argumentos, sólo su nombre:

#+begin_src scss
p {
  color: hsl($hue: 0, $saturation: 100%, $lightness: 50%);
}
#+end_src

Aunque obviamente esta forma de usar las funciones no es tan concisa, hace que las hojas de estilo resultantes sean mucho más fáciles de leer. Además permite que las funciones tengan interfaces más flexibles y fáciles de usar, aún cuando incluyan muchos argumentos.

Los argumentos con nombre se pueden pasar en cualquier orden y puedes omitir los que tienen un valor por defecto. Además, como los argumentos con nombre en realidad son nombres de variables, puedes utilizar indistintamente guiones medios y bajos.

En los próximos capítulos se detalla la lista completa de funciones Sass y los nombres de todos sus argumentos.

** Interpolación

Las variables definidas con SassScript se pueden utilizar incluso en los nombres de los selectores y de las propiedades:

#+begin_src scss
$name: foo;
$attr: border;
 
p.#{$name} {
  #{$attr}-color: blue;
}
#+end_src

Que dará lugar a:

#+begin_src css
p.foo {
  border-color: blue;
}
#+end_src

También es posible usar #{ } en los valores de las propiedades. Normalmente es mejor utilizar una variable, pero la ventaja de usar #{ } es que todas las operaciones que estén cerca suyo se interpretan como código CSS normal y corriente. Ejemplo:

#+begin_src scss
p {
  $font-size: 12px;
  $line-height: 30px;
  font: #{$font-size}/#{$line-height};
}
#+end_src

Dando lugar a:

#+begin_src css
p {
  font: 12px/30px;
}
#+end_src

