doc/html/sass.html

<div id="outline-container-org9795b35" class="outline-4">
<h4 id="org9795b35">Operadores para cadenas de texto</h4>
<div class="outline-text-4" id="text-org9795b35">
<p>
El operador + se puede utilizar para concatenar dos o más cadenas de texto:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">cursor</span>: e + -resize;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
El código css resultantes será:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">cursor</span>: e-resize;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si la cadena que está a la izquierda del operador + está encerrada por comillas, el resultado de la operación será una cadena con comillas. Igualmente, si la cadena de la izquierda no tiene comillas, el resultado será una cadena sin comillas. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"Foo "</span> + Bar;
  <span class="org-css-property">font-family</span>: sans- + <span class="org-string">"serif"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código css resultante:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"Foo Bar"</span>;
  <span class="org-css-property">font-family</span>: sans-serif;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Por defecto, si dos valores son contiguos, se concatenan con un espacio en blanco:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">margin</span>: 3px + 4px auto;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto dará el siguiente css:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">margin</span>: 7px auto;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Dentro de una cadena de texto puedes utilizar la sintaxis #{ } para realizar operaciones matemáticas o para evaluar expresiones antes de incluirlas en la cadena. Esta característica se llama "<b>interpolación de cadenas de texto</b>":
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"&#161;Me he comido #{5 + 10} pasteles!"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código css resultante:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"&#161;Me he comido 15 pasteles!"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Cuando interpolas una cadena de texto, los valores nulos se consideran cadenas vacías:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$value</span>: null;

<span class="org-css-selector">p:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"&#161;Me he comido #{$valor} pasteles!"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto dará:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p:before </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">content</span>: <span class="org-string">"&#161;Me he comido pasteles!"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb67d97a" class="outline-4">
<h4 id="orgb67d97a">Operadores para valores lógicos o booleanos</h4>
<div class="outline-text-4" id="text-orgb67d97a">
<p>
SassScript soporta el uso de los tradicionales operadores and, or y not sobre los valores lógicos o booleanos.
</p>
</div>
</div>

<div id="outline-container-org33223fd" class="outline-4">
<h4 id="org33223fd">Operadores para listas</h4>
<div class="outline-text-4" id="text-org33223fd">
<p>
Sass no define ningún operador específico para las listas de elementos, ya que estas se manipulan mediante las funciones especiales que se explican en los siguientes capítulos.
</p>
</div>
</div>
</div>

<div id="outline-container-org63e841a" class="outline-3">
<h3 id="org63e841a">Paréntesis</h3>
<div class="outline-text-3" id="text-org63e841a">
<p>
Puedes añadir paréntesis a cualquier expresión Sass para afectar al orden en el que se realizan las operaciones:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 1em + <span class="org-rainbow-delimiters-depth-2">(</span>2em * 3<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass se compila:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 7em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org527a42b" class="outline-3">
<h3 id="org527a42b">Funciones</h3>
<div class="outline-text-3" id="text-org527a42b">
<p>
SassScript define algunas funciones muy útiles para crear las hojas de estilos y que utilizan la misma sintaxis que CSS:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">hsl(0, 100%, 50%)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto se compila:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">#ff0000</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>

<div id="outline-container-org0a0f51a" class="outline-4">
<h4 id="org0a0f51a">Argumentos con nombre</h4>
<div class="outline-text-4" id="text-org0a0f51a">
<p>
Para que su uso sea más flexible, a las funciones de Sass les puedes pasar argumentos con nombre. De esta manera no es obligatorio respetar el orden en el que se definieron los argumentos, sólo su nombre:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: hsl<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$hue</span>: 0, <span class="org-variable-name">$saturation</span>: 100%, <span class="org-variable-name">$lightness</span>: 50%<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Aunque obviamente esta forma de usar las funciones no es tan concisa, hace que las hojas de estilo resultantes sean mucho más fáciles de leer. Además permite que las funciones tengan interfaces más flexibles y fáciles de usar, aún cuando incluyan muchos argumentos.
</p>

<p>
Los argumentos con nombre se pueden pasar en cualquier orden y puedes omitir los que tienen un valor por defecto. Además, como los argumentos con nombre en realidad son nombres de variables, puedes utilizar indistintamente guiones medios y bajos.
</p>

<p>
En los próximos capítulos se detalla la lista completa de funciones Sass y los nombres de todos sus argumentos.
</p>
</div>
</div>
</div>

<div id="outline-container-org4b72882" class="outline-3">
<h3 id="org4b72882">Interpolación</h3>
<div class="outline-text-3" id="text-org4b72882">
<p>
Las variables definidas con SassScript se pueden utilizar incluso en los nombres de los selectores y de las propiedades:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$name</span>: foo;
<span class="org-variable-name">$attr</span>: border;

<span class="org-css-selector">p.#</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-1">{</span></span><span class="org-variable-name">$name</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-1">}</span></span><span class="org-css-selector"> </span><span class="org-rainbow-delimiters-depth-1">{</span>
  #<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">$attr</span><span class="org-rainbow-delimiters-depth-2">}</span>-color: <span class="custom">blue</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Que dará lugar a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p.foo </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-color</span>: <span class="custom">blue</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
También es posible usar #{ } en los valores de las propiedades. Normalmente es mejor utilizar una variable, pero la ventaja de usar #{ } es que todas las operaciones que estén cerca suyo se interpretan como código CSS normal y corriente. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-variable-name">$font-size</span>: 12px;
  <span class="org-variable-name">$line-height</span>: 30px;
  <span class="org-css-property">font</span>: #<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">$font-size</span><span class="org-rainbow-delimiters-depth-2">}</span>/#<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">$line-height</span><span class="org-rainbow-delimiters-depth-2">}</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Dando lugar a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: 12px/30px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
