org/sass.org
** Variables con valores por defecto

La palabra reservada !default permite controlar la asignación de valores a las variables de manera mucho más precisa. Si una variable ya tenía un valor asignado, !default hace que se mantenga sin cambios. Si la variable no existía o no tenía ningún valor, se utiliza el nuevo valor asignado. Ejemplo:

#+begin_src scss
$contenido: "Primer contenido";
$contenido: "¿Segundo contenido?" !default;
$nuevo_contenido: "Tercer contenido" !default;
 
#main {
  contenido: $contenido;
  nuevo-contenido: $nuevo_contenido;
}
#+end_src

Que dará el siguiente código css:

#+begin_src css
#main {
  contenido: "Primer contenido";
  nuevo-contenido: "Tercer contenido";
}
#+end_src

Al utilizar !default, las variables con valores nulos se considera que no han sido asignadas:

#+begin_src scss
$contenido: null;
$contenido: "Contenido no nulo" !default;
 
#main {
  contenido: $contenido;
}
#+end_src

El código Sass anterior se compila de la siguiente manera:

#+begin_src css
#main {
  contenido: "Contenido no nulo";
}
#+end_src

* Reglas @ y directivas

Sass soporta todas las reglas @ (también llamadas "reglas at") definidas por CSS3. Además, Sass incluye varias reglas específicas llamadas directivas.

** La regla @import

Sass mejora la regla @import de CSS para poder importar también archivos SCSS y Sass. Todos los archivos importados, independientemente de su tipo, acaban fusionándose antes de generar el archivo CSS final. Además, cualquier variable o mixin definidos en los archivos importados se pueden utilizar en la hoja de estilos principal.

Los archivos importados se buscan automáticamente en el directorio actual. Utiliza la opción de configuración :load_paths para configurar todos los directorios adicionales en los que quieras buscar archivos. También puedes utilizar la opción --load-path del comando sass.

La regla @import espera como argumento el nombre del archivo a importar. Por defecto busca un archivo Sass y lo importar directamente, pero a veces esta regla se deja tal cual al compilar el archivo CSS:

+ Si la extensión del archivo importado es .css
+ Si el nombre del archivo empieza por http://
+ Si el nombre del archivo se indica mediante url()
+ Si la regla @import tiene alguna /media query/

Si no se da ninguna de las anteriores circunstancias, y la extensión del archivo importado es .scss o .sass, entonces se importan directamente los contenidos de ese archivo. Si no se indica la extensión, Sass tratará de buscar un archivo con ese nombre y con las extensiones .scss o .sass. Ejemplos:

| Regla @                       | Resultado                      |
|-------------------------------+--------------------------------|
| @import "foo.scss";           | Se importa el archivo foo.scss |
| @import "foo";                | Se importa el archivo foo.scss |
| @import "foo.css";            | @import "foo.css";             |
| @import "foo" screen;         | @import "foo" screen           |
| @import "http://foo.com/bar"; | @import "http://foo.com/bar";  |
| @import url(foo)              | @import url(foo)               |

También es posible importar varios archivos con una sola regla *@import*. Ejemplo:

#+begin_src scss
@import "rounded-corners", "text-shadow";
#+end_src


El nombre del archivo importado también se puede establecer con la interpolación #{ }, pero con ciertas restricciones. No se puede importar dinámicamente un archivo Sass en base al nombre de una variable, pero sí que se puede importar de esta manera un archivo CSS. De forma que la interpolación solamente funciona en la práctica cuando se utiliza url(). Ejemplo:

#+begin_src scss
$family: unquote("Droid+Sans");
@import url("http://fonts.googleapis.com/css?family=#{$family}");
#+end_src

Esto resultarán en:
#+begin_src css
@import url("http://fonts.googleapis.com/css?family=Droid+Sans");
#+end_src

** Hojas de estilo parciales

Si quieres importar un archivo SCSS o Sass pero no quieres que se compile como archivo CSS, utiliza un guión bajo como primer carácter del nombre del archivo. De esta manera, Sass no generará un archivo CSS para esa hoja de estilos, pero podrás utilizarla importándola dentro de otra hoja de estilos. Este tipo de archivos que no se compilan se denominan "hojas de estilos parciales" o simplemente "parciales" (en inglés, "partials").

Aunque el nombre del archivo tenga un guión bajo, no es necesario indicarlo en la regla @import. Así por ejemplo, si creas un archivo llamado _colors.scss, entonces no se generará un archivo _colors.css. Sin embargo, podrás utilizarlo en tus hojas de estilos con la regla @import "colors";, que importará el archivo _colors.scss.

Obviamente no puedes tener en un mismo directorio una hoja de estilos normal y una parcial con el mismo nombre. Siguiendo el ejemplo anterior, en el mismo directorio no puedes tener un archivo llamado _colors.scss y otro llamado colors.scss.

