doc/html/sass.html

<div id="outline-container-orgd24f768" class="outline-3">
<h3 id="orgd24f768">Variables con valores por defecto</h3>
<div class="outline-text-3" id="text-orgd24f768">
<p>
La palabra reservada !default permite controlar la asignación de valores a las variables de manera mucho más precisa. Si una variable ya tenía un valor asignado, !default hace que se mantenga sin cambios. Si la variable no existía o no tenía ningún valor, se utiliza el nuevo valor asignado. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$contenido</span>: <span class="org-string">"Primer contenido"</span>;
<span class="org-variable-name">$contenido</span>: <span class="org-string">"&#191;Segundo contenido?"</span> <span class="org-builtin">!default</span>;
<span class="org-variable-name">$nuevo</span>_contenido: <span class="org-string">"Tercer contenido"</span> <span class="org-builtin">!default</span>;

<span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">contenido</span>: <span class="org-variable-name">$contenido</span>;
  <span class="org-css-property">nuevo-contenido</span>: <span class="org-variable-name">$nuevo</span>_contenido;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Que dará el siguiente código css:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">contenido</span>: <span class="org-string">"Primer contenido"</span>;
  <span class="org-css-property">nuevo-contenido</span>: <span class="org-string">"Tercer contenido"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Al utilizar !default, las variables con valores nulos se considera que no han sido asignadas:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$contenido</span>: null;
<span class="org-variable-name">$contenido</span>: <span class="org-string">"Contenido no nulo"</span> <span class="org-builtin">!default</span>;

<span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">contenido</span>: <span class="org-variable-name">$contenido</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">contenido</span>: <span class="org-string">"Contenido no nulo"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org90f44ed" class="outline-2">
<h2 id="org90f44ed">Reglas @ y directivas</h2>
<div class="outline-text-2" id="text-org90f44ed">
<p>
Sass soporta todas las reglas @ (también llamadas "reglas at") definidas por CSS3. Además, Sass incluye varias reglas específicas llamadas directivas.
</p>
</div>

<div id="outline-container-orga19ed68" class="outline-3">
<h3 id="orga19ed68">La regla @import</h3>
<div class="outline-text-3" id="text-orga19ed68">
<p>
Sass mejora la regla @import de CSS para poder importar también archivos SCSS y Sass. Todos los archivos importados, independientemente de su tipo, acaban fusionándose antes de generar el archivo CSS final. Además, cualquier variable o mixin definidos en los archivos importados se pueden utilizar en la hoja de estilos principal.
</p>

<p>
Los archivos importados se buscan automáticamente en el directorio actual. Utiliza la opción de configuración :load<sub>paths</sub> para configurar todos los directorios adicionales en los que quieras buscar archivos. También puedes utilizar la opción &#x2013;load-path del comando sass.
</p>

<p>
La regla @import espera como argumento el nombre del archivo a importar. Por defecto busca un archivo Sass y lo importar directamente, pero a veces esta regla se deja tal cual al compilar el archivo CSS:
</p>

<ul class="org-ul">
<li>Si la extensión del archivo importado es .css</li>
<li>Si el nombre del archivo empieza por <a href="http://">http://</a></li>
<li>Si el nombre del archivo se indica mediante url()</li>
<li>Si la regla @import tiene alguna <i>media query</i></li>
</ul>

<p>
Si no se da ninguna de las anteriores circunstancias, y la extensión del archivo importado es .scss o .sass, entonces se importan directamente los contenidos de ese archivo. Si no se indica la extensión, Sass tratará de buscar un archivo con ese nombre y con las extensiones .scss o .sass. Ejemplos:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Regla @</th>
<th scope="col" class="org-left">Resultado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">@import "foo.scss";</td>
<td class="org-left">Se importa el archivo foo.scss</td>
</tr>

<tr>
<td class="org-left">@import "foo";</td>
<td class="org-left">Se importa el archivo foo.scss</td>
</tr>

<tr>
<td class="org-left">@import "foo.css";</td>
<td class="org-left">@import "foo.css";</td>
</tr>

<tr>
<td class="org-left">@import "foo" screen;</td>
<td class="org-left">@import "foo" screen</td>
</tr>

<tr>
<td class="org-left">@import "<a href="http://foo.com/bar">http://foo.com/bar</a>";</td>
<td class="org-left">@import "<a href="http://foo.com/bar">http://foo.com/bar</a>";</td>
</tr>

<tr>
<td class="org-left">@import url(foo)</td>
<td class="org-left">@import url(foo)</td>
</tr>
</tbody>
</table>

<p>
También es posible importar varios archivos con una sola regla <b>@import</b>. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@import</span> <span class="org-string">"rounded-corners"</span>, <span class="org-string">"text-shadow"</span>;
</pre>
</div>


<p>
El nombre del archivo importado también se puede establecer con la interpolación #{ }, pero con ciertas restricciones. No se puede importar dinámicamente un archivo Sass en base al nombre de una variable, pero sí que se puede importar de esta manera un archivo CSS. De forma que la interpolación solamente funciona en la práctica cuando se utiliza url(). Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$family</span>: unquote<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"Droid+Sans"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-builtin">@import</span> url<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"http://fonts.googleapis.com/css?family=#{$family}"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
Esto resultarán en:
</p>
<div class="org-src-container">
<pre class="src src-css"><span class="org-builtin">@import</span> url<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"http://fonts.googleapis.com/css?family=Droid+Sans"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa6a364" class="outline-3">
<h3 id="orgfa6a364">Hojas de estilo parciales</h3>
<div class="outline-text-3" id="text-orgfa6a364">
<p>
Si quieres importar un archivo SCSS o Sass pero no quieres que se compile como archivo CSS, utiliza un guión bajo como primer carácter del nombre del archivo. De esta manera, Sass no generará un archivo CSS para esa hoja de estilos, pero podrás utilizarla importándola dentro de otra hoja de estilos. Este tipo de archivos que no se compilan se denominan "hojas de estilos parciales" o simplemente "parciales" (en inglés, "partials").
</p>

<p>
Aunque el nombre del archivo tenga un guión bajo, no es necesario indicarlo en la regla @import. Así por ejemplo, si creas un archivo llamado _colors.scss, entonces no se generará un archivo _colors.css. Sin embargo, podrás utilizarlo en tus hojas de estilos con la regla @import "colors";, que importará el archivo _colors.scss.
</p>

<p>
Obviamente no puedes tener en un mismo directorio una hoja de estilos normal y una parcial con el mismo nombre. Siguiendo el ejemplo anterior, en el mismo directorio no puedes tener un archivo llamado _colors.scss y otro llamado colors.scss.
</p>
</div>
</div>
