doc/html/sass.html

<div id="outline-container-orga1cf817" class="outline-3">
<h3 id="orga1cf817">Anidando reglas @import</h3>
<div class="outline-text-3" id="text-orga1cf817">
<p>
Normalmente las reglas @import se colocan en el primer nivel jerárquico de la hoja de estilos. No obstante, también es posible colocarlas dentro de reglas CSS y reglas @media.
</p>

<p>
El funcionamiento de las reglas anidadas es el mismo, pero todos los contenidos importados se incluyen en el mismo nivel en el que se hayan importado. Si por ejemplo el archivo example.scss contiene lo siguiente:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.example </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">red</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si importas este archivo dentro de una regla CSS:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@import</span> <span class="org-string">"example"</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El archivo css compilado será:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main .example </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">red</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Los archivos importados con reglas @import anidadas no pueden contener elementos y directivas que sólo pueden colocarse en el primer nivel jerárquico de las hojas de estilos, como @mixin o @charset.
</p>

<p>
Tampoco es posible anidar reglas @import dentro de los mixin y las directivas de control.
</p>
</div>
</div>

<div id="outline-container-orgf2d0361" class="outline-3">
<h3 id="orgf2d0361">La regla @media</h3>
<div class="outline-text-3" id="text-orgf2d0361">
<p>
Las reglas @media en Sass funcionan prácticamente igual que en CSS, con una salvedad: se pueden anidar dentro de las reglas CSS. Si incluyes una regla @media dentro de una regla CSS, se aplicará a todos los selectores que se encuentren desde esa regla hasta el primer nivel de la hoja de estilos. Esto hace que sea muy fácil definir estilos dependientes de los dispositivos sin tener que repetir los selectores y sin tener que romper el flujo normal de la hoja de estilos Sass. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 300px;
  <span class="org-builtin">@media</span> screen and <span class="org-rainbow-delimiters-depth-2">(</span>orientation: landscape<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 500px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código dará como resultado:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 300px;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-builtin">@media</span> screen and <span class="org-rainbow-delimiters-depth-1">(</span>orientation: landscape<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 500px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Las reglas @media también se pueden anidar entre sí. El resultado la combinación de todas ellas utilizando el operador and. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@media</span> screen <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-builtin">@media</span> <span class="org-rainbow-delimiters-depth-3">(</span>orientation: landscape<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
      <span class="org-css-property">width</span>: 500px;
    <span class="org-rainbow-delimiters-depth-3">}</span>
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Dará lugar a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-builtin">@media</span> screen and <span class="org-rainbow-delimiters-depth-1">(</span>orientation: landscape<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 500px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Por último, las reglas @media también pueden contener expresiones SassScript (incluyendo variables, funciones y operadores) tanto en los nombres como en los valores. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$media</span>: screen;
<span class="org-variable-name">$feature</span>: -webkit-min-device-pixel-ratio;
<span class="org-variable-name">$value</span>: 1.5;

<span class="org-builtin">@media</span> #<span class="org-rainbow-delimiters-depth-1">{</span><span class="org-variable-name">$media</span><span class="org-rainbow-delimiters-depth-1">}</span> and <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$feature</span>: <span class="org-variable-name">$value</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 500px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-builtin">@media</span> screen and <span class="org-rainbow-delimiters-depth-1">(</span>-webkit-min-device-pixel-ratio: 1.5<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.sidebar </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 500px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
