org/sass.org
** La regla @extend

En ocasiones, es necesario que una clase CSS contenga todos los estilos aplicados a otra regla CSS, además de sus propios estilos. La solución habitual en estos casos consiste en crear una clase genérica que puedan utilizar los dos elementos. Imagina que quieres aplicar estilos a dos tipos de mensajes de error diferentes, uno normal y otro más grave. El código HTML podría ser algo como:

#+begin_src html
<div class="error seriousError">
  ¡Acabas de ser hackeado!
</div>
#+end_src

Los estilos CSS podrían ser los siguientes:

#+begin_src css
.error {
  border: 1px #f00;
  background-color: #fdd;
}
.seriousError {
  border-width: 3px;
}
#+end_src

El problema de esta solución es que tienes que acordarte que siempre que apliques la clase .seriousError también tienes que aplicar la clase .error. Esto hace que el mantenimiento de las hojas de estilos se complique y el código HTML de las páginas se complique sin una justificación clara.

Gracias a la regla @extend puedes evitar todos estos problemas. Esta regla le indica a Sass que un determinado selector debería heredar todos los estilos de otro selector. Ejemplo:

#+begin_src scss
.error {
  border: 1px #f00;
  background-color: #fdd;
}
.seriousError {
  @extend .error;
  border-width: 3px;
}
#+end_src

El código anterior se compila de la siguiente manera:

#+begin_src css
.error, .seriousError {
  border: 1px #f00;
  background-color: #fdd;
}
 
.seriousError {
  border-width: 3px;
}
#+end_src

Ahora, todos los estilos que definas para el selector .error también se aplican automáticamente al selector .seriousError, al margen de los estilos propios que pueda definir .seriousError. En la práctica esto significa que cuando apliques la clase .seriousError es como si estuvieras aplicando a la vez la clase .error.

Cualquier otra regla que se aplique al selector .error también se aplicará al selector .seriousError. Imagina que defines el siguiente estilo que se aplica simultáneamente a dos clases CSS:

#+begin_src scss
.error.intrusion {
  background-image: url("/image/hacked.png");
}
#+end_src

Si ahora añades en tus páginas un elemento como <div class="seriousError intrusion">, también se le aplicará el estilo definido por el selector .error.intrusion.

*** Funcionamiento interno

#+begin_src scss
.error {
  border: 1px #f00;
  background-color: #fdd;
}
.error.intrusion {
  background-image: url("/image/hacked.png");
}
.seriousError {
  @extend .error;
  border-width: 3px;
}
#+end_src

Este código Sass dará el siguiente código css:

#+begin_src css
.error, .seriousError {
  border: 1px #f00;
  background-color: #fdd;
}
 
.error.intrusion, .seriousError.intrusion {
  background-image: url("/image/hacked.png");
}
 
.seriousError {
  border-width: 3px;
}
#+end_src

Al combinar los selectores, la regla @extend es lo bastante inteligente como para evitar las duplicidades innecesarias (un selector como .seriousError.seriousError se transforma automáticamente en .seriousError). También tiene en cuenta los selectores que nunca podrían seleccionar ningún elemento, como por ejemplo #main#footer.

*** Extendiendo selectores complejos
Además de los selectores de clase, Sass permite extender cualquier otro elemento que haga referencia a un único elemento, como por ejemplo .special.cool, a:hover o a.user[href^="http://"]. Ejemplo:

#+begin_src scss
.hoverlink {
  @extend a:hover;
}
#+end_src

Al igual que en el caso de los selectores de clase, este estilo implica que todos los estilos definidos para el selector a:hover también se aplicarán al selector .hoverlink. Ejemplo:

#+begin_src scss
.hoverlink {
  @extend a:hover;
}
a:hover {
  text-decoration: underline;
}
#+end_src

El código anterior compilará en:

#+begin_src css
a:hover, .hoverlink {
  text-decoration: underline;
}
#+end_src

Al igual que sucedía antes con el selector .error.intrusion, cualquier regla que utilice el selector a:hover también funcionará para el selector .hoverlink, incluso cuando se combinan con otros selectores. Ejemplo:

#+begin_src scss
.hoverlink {
  @extend a:hover;
}
.comment a.user:hover {
  font-weight: bold;
}
#+end_src

El código Sass anterior compilará en:

#+begin_src css
.comment a.user:hover, .comment .user.hoverlink {
  font-weight: bold;
}
#+end_src

