doc/html/sass.html

<div id="outline-container-orgb184b7f" class="outline-3">
<h3 id="orgb184b7f">La regla @extend</h3>
<div class="outline-text-3" id="text-orgb184b7f">
<p>
En ocasiones, es necesario que una clase CSS contenga todos los estilos aplicados a otra regla CSS, además de sus propios estilos. La solución habitual en estos casos consiste en crear una clase genérica que puedan utilizar los dos elementos. Imagina que quieres aplicar estilos a dos tipos de mensajes de error diferentes, uno normal y otro más grave. El código HTML podría ser algo como:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"error seriousError"</span>&gt;
  &#161;Acabas de ser hackeado!
&lt;/<span class="org-function-name">div</span>&gt;
</pre>
</div>

<p>
Los estilos CSS podrían ser los siguientes:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El problema de esta solución es que tienes que acordarte que siempre que apliques la clase .seriousError también tienes que aplicar la clase .error. Esto hace que el mantenimiento de las hojas de estilos se complique y el código HTML de las páginas se complique sin una justificación clara.
</p>

<p>
Gracias a la regla @extend puedes evitar todos estos problemas. Esta regla le indica a Sass que un determinado selector debería heredar todos los estilos de otro selector. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> .error;
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.error, .seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Ahora, todos los estilos que definas para el selector .error también se aplican automáticamente al selector .seriousError, al margen de los estilos propios que pueda definir .seriousError. En la práctica esto significa que cuando apliques la clase .seriousError es como si estuvieras aplicando a la vez la clase .error.
</p>

<p>
Cualquier otra regla que se aplique al selector .error también se aplicará al selector .seriousError. Imagina que defines el siguiente estilo que se aplica simultáneamente a dos clases CSS:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.error.intrusion </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"/image/hacked.png"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si ahora añades en tus páginas un elemento como &lt;div class="seriousError intrusion"&gt;, también se le aplicará el estilo definido por el selector .error.intrusion.
</p>
</div>

<div id="outline-container-org72bf3e9" class="outline-4">
<h4 id="org72bf3e9">Funcionamiento interno</h4>
<div class="outline-text-4" id="text-org72bf3e9">
<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.error.intrusion </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"/image/hacked.png"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> .error;
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Este código Sass dará el siguiente código css:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.error, .seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.error.intrusion, .seriousError.intrusion </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"/image/hacked.png"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Al combinar los selectores, la regla @extend es lo bastante inteligente como para evitar las duplicidades innecesarias (un selector como .seriousError.seriousError se transforma automáticamente en .seriousError). También tiene en cuenta los selectores que nunca podrían seleccionar ningún elemento, como por ejemplo #main#footer.
</p>
</div>
</div>

<div id="outline-container-orga7b99d1" class="outline-4">
<h4 id="orga7b99d1">Extendiendo selectores complejos</h4>
<div class="outline-text-4" id="text-orga7b99d1">
<p>
Además de los selectores de clase, Sass permite extender cualquier otro elemento que haga referencia a un único elemento, como por ejemplo .special.cool, a:hover o a.user[href^="<a href="http://">http://</a>"]. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.hoverlink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a:hover;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Al igual que en el caso de los selectores de clase, este estilo implica que todos los estilos definidos para el selector a:hover también se aplicarán al selector .hoverlink. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.hoverlink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a:hover;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">a:hover </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">text-decoration</span>: underline;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código anterior compilará en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">a:hover, .hoverlink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">text-decoration</span>: underline;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Al igual que sucedía antes con el selector .error.intrusion, cualquier regla que utilice el selector a:hover también funcionará para el selector .hoverlink, incluso cuando se combinan con otros selectores. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.hoverlink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a:hover;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.comment a.user:hover </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior compilará en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.comment a.user:hover, .comment .user.hoverlink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
