doc/html/sass.html

<div id="outline-container-orgc56d01e" class="outline-4">
<h4 id="orgc56d01e">Extendiendo de varios selectores</h4>
<div class="outline-text-4" id="text-orgc56d01e">
<p>
Los selectores pueden extender de más de un selector para heredar todos sus estilos. Ejemplo
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-2">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom-1">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.attention </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 3em;
  <span class="org-css-property">background-color</span>: <span class="custom">#ff0</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> .error;
  <span class="org-builtin">@extend</span> .attention;
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
El c&#243;digo Sass anterior se compila de la siguiente manera:

<span class="org-css-selector">.error, .seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-2">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom-1">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.attention, .seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 3em;
  <span class="org-css-property">background-color</span>: <span class="custom">#ff0</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
En este ejemplo, cualquier elemento con la clase .seriousError es como si también tuviera aplicadas las clases .error y .attention. Como importa el orden en el que se extienden los selectores, el selector .seriousError tiene un color de fondo igual a #ff0 en vez de #fdd, ya que .attention se define después que .error.
</p>

<p>
La extensión de más de un selector también se puede indicar mediante una lista de selectores separados por comas. Así por ejemplo, el código @extend .error, .attention es equivalente a @extend .error; @extend.attention.
</p>
</div>
</div>

<div id="outline-container-org3f5c6f9" class="outline-4">
<h4 id="org3f5c6f9">Extendiendo a varios niveles</h4>
<div class="outline-text-4" id="text-org3f5c6f9">
<p>
Sass también permite extender de un selector que a su vez extiende de otro selector diferente. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> .error;
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.criticalError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> .seriousError;
  <span class="org-css-property">position</span>: fixed;
  <span class="org-css-property">top</span>: 10%;
  <span class="org-css-property">bottom</span>: 10%;
  <span class="org-css-property">left</span>: 10%;
  <span class="org-css-property">right</span>: 10%;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Ahora aplicar la clase .seriousError equivale también a aplicar la clase .error y la clase .criticalError equivale a aplicar también las clases .seriousError y .error. El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.error, .seriousError, .criticalError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.seriousError, .criticalError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-width</span>: 3px;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.criticalError </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">position</span>: fixed;
  <span class="org-css-property">top</span>: 10%;
  <span class="org-css-property">bottom</span>: 10%;
  <span class="org-css-property">left</span>: 10%;
  <span class="org-css-property">right</span>: 10%;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgad2acfa" class="outline-4">
<h4 id="orgad2acfa">Secuencia de selectores</h4>
<div class="outline-text-4" id="text-orgad2acfa">
<p>
Las secuencias de selectores, como por ejemplo .foo .bar o .foo + .bar, todavía no se pueden extender. No obstante, sí que es posible utilizar la regla @extend en los selectores anidados. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#fake-links .link </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">blue</span>;
  <span class="org-css-selector">&amp;:hover </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">text-decoration</span>: underline;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">a, #fake-links .link </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">blue</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">a:hover, #fake-links .link:hover </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">text-decoration</span>: underline;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>

<ul class="org-ul"><li><a id="org14f40c0"></a>Combinando secuencias de selectores<br /><div class="outline-text-5" id="text-org14f40c0">
<p>
En ocasiones una secuencia de selectores extiende otro selector que está incluido en otra secuencia de selectores. En este caso, se combinan las dos secuencias de selectores. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#admin .tabbar a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#demo .overview .fakelink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Aunque técnicamente sería posible generar todos los selectores resultantes de combinar todos los selectores entre sí, esto haría que la hoja de estilos resultante fuera demasiado larga. Un código tan sencillo como el mostrado anteriormente generaría por ejemplo diez selectores. Así que en vez de generar todas las combinaciones posibles, Sass solamente genera aquellos selectores que probablemente van a ser de utilidad.
</p>

<p>
Cuando las dos secuencias que se van a combinar no tienen selectores en común, entonces se generan dos nuevos selectores: uno con la primera secuencia por delante de la segunda y otro con la segunda secuencia por delante de la primera. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#admin .tabbar a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#demo .overview .fakelink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código resultante:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#admin .tabbar a,</span>
<span class="org-css-selector">#admin .tabbar #demo .overview .fakelink,</span>
<span class="org-css-selector">#demo .overview #admin .tabbar .fakelink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Si las dos secuencias tienen algunos selectores en común, se combinan esos selectores y las diferencias, si exsten, se alternan. En el siguiente ejemplo, las dos secuencias tienen el selector #admin, así que los selectores resultantes serán el resultado de combinar esos dos selectores de id:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#admin .tabbar a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#admin .overview .fakelink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> a;
<span class="org-rainbow-delimiters-depth-1">}</span>
El c&#243;digo Sass anterior se compila de la siguiente manera:

<span class="org-css-selector">#admin .tabbar a,</span>
<span class="org-css-selector">#admin .tabbar .overview .fakelink,</span>
<span class="org-css-selector">#admin .overview .tabbar .fakelink </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div></li></ul>
</div>
