doc/html/sass.html

<div id="outline-container-orgb2efcfe" class="outline-4">
<h4 id="orgb2efcfe">Selectores exclusivos para reglas @extend</h4>
<div class="outline-text-4" id="text-orgb2efcfe">
<p>
Las hojas de estilos también pueden contener clases que no se utilizan directamente en el código HTML y que sólo se definen para agrupar estilos que luego se utilizan mediante reglas @extend. Esto es común cuando se escriben librerías para Sass, ya que puede ser interesante ofrecer a los diseñadores la posibilidad de extender o ignorar algunas clases en sus estilos.
</p>

<p>
Si utilizaras clases normales, acabarías generando un código CSS demasiado grande y poco optimizado. Incluso correrías el peligro de generar colisiones con otras clases que sí que se utilizan en el código HTML. Por este motivo Sass soporta los selectores variables con la sintaxis %foo.
</p>

<p>
Los selectores variables (en inglés, "placeholder parameters") se parecen a los selectores de clase o de id, pero utilizan el carácter % en vez de . o #. Estos nuevos selectores se pueden utilizar en cualquier lugar en el que utilices los selectores de clase o de id y están preparados para no generar código CSS al compilar las hojas de estilos. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-comment-delimiter">// </span><span class="org-comment">Este estilo no se incluir&#225; en el archivo CSS compilado</span>
<span class="org-css-selector">#context a%extreme </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">blue</span>;
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">font-size</span>: 2em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
La ventaja de los selectores variables es que se pueden extender, de la misma manera que el resto de selectores. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.notice </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> %extreme;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#context a.notice </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">blue</span>;
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">font-size</span>: 2em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e5d3cb" class="outline-4">
<h4 id="org7e5d3cb">La opción !optional</h4>
<div class="outline-text-4" id="text-org7e5d3cb">
<p>
Cuando extiendes un selector que no existe, Sass genera un error. Si utilizas por ejemplo el código a.important {@extend .notice} pero no existe el selector .notice, entonces se produce un error. También se produciría un error si el único selector que contiene la clase .notice fuera h1.notice, ya que h1 entraría en conflicto con a y no se generaría ningún selector.
</p>

<p>
No obstante, en ocasiones puede ser útil permitir que @extend no genere ningún selector. Para ello, añade la opción !optional justo después del selector. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">a.important </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@extend</span> .notice <span class="org-builtin">!optional</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7a5d27" class="outline-4">
<h4 id="orgf7a5d27">Usando @extend en las directivas</h4>
<div class="outline-text-4" id="text-orgf7a5d27">
<p>
Existen algunas restricciones que impiden usar @extend en el interior de directivas como @media. Sass por ejemplo no es capaz de hacer que las reglas CSS que se encuentran fuera de la directiva @media se apliquen a los selectores de su interior sin generar un código CSS gigantesco con selectores y estilos duplicados por todas partes. Por lo tanto, si utilizas @extend con la directiva @media o con otras directivas CSS, sólo debes extender los selectores que están encerrados por esas directivas.
</p>

<p>
El siguiente ejemplo funciona correctamente:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@media</span> print <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
    <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-builtin">@extend</span> .error;
    <span class="org-css-property">border-width</span>: 3px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Pero el siguiente produciría un error:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.error </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px <span class="custom-1">#f00</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#fdd</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-builtin">@media</span> print <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.seriousError </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">ESTILO INV&#193;LIDO: .error se utiliza fuera de la directiva "@media print"</span>
    <span class="org-builtin">@extend</span> .error;
    <span class="org-css-property">border-width</span>: 3px;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd2946a" class="outline-3">
<h3 id="orgdd2946a">La regla @at-root</h3>
<div class="outline-text-3" id="text-orgdd2946a">
<p>
Las directivas @at-root hacen que una o más reglas se generen en la raíz de la hoja de estilos en vez de anidarse en sus selectores. Se puede utilizar tanto con selectores individuales como con bloques de selectores. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-comment-delimiter">// </span><span class="org-comment">selector individual</span>
<span class="org-css-selector">.parent </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@at-root</span> .child <span class="org-rainbow-delimiters-depth-2">{</span> ... <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">bloques de selectores</span>
<span class="org-css-selector">.parent </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@at-root</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-selector">.child1 </span><span class="org-rainbow-delimiters-depth-3">{</span> ... <span class="org-rainbow-delimiters-depth-3">}</span>
    <span class="org-css-selector">.child2 </span><span class="org-rainbow-delimiters-depth-3">{</span> ... <span class="org-rainbow-delimiters-depth-3">}</span>
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código anterior Sass se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.child </span><span class="org-rainbow-delimiters-depth-1">{</span> ... <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.child1 </span><span class="org-rainbow-delimiters-depth-1">{</span> ... <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.child2 </span><span class="org-rainbow-delimiters-depth-1">{</span> ... <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
