doc/html/sass.html

<div id="outline-container-org6409995" class="outline-4">
<h4 id="org6409995">Modificando la regla @at-root con with y without</h4>
<div class="outline-text-4" id="text-org6409995">
<p>
Por defecto la regla @at-root simplemente excluye todos los selectores. No obstante, también es posible modificar su comportamiento para que salga o no de cualquier directiva @media en la que se encuentre esa regla. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@media</span> print <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.page </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 8in;
    <span class="org-builtin">@at-root</span> <span class="org-rainbow-delimiters-depth-3">(</span>without: media<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
      <span class="org-css-property">color</span>: <span class="custom">red</span>;
    <span class="org-rainbow-delimiters-depth-3">}</span>
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-builtin">@media</span> print <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.page </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: 8in;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.page </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">red</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>


<p>
La regla @at-root (without: &#x2026;) hace que el estilo se aplique en la raíz de la hoja de estilos y fuera de cualquier media query. También es posible excluir varias directivas separándolas con espacios en blanco: @at-root (without: media supports) saca los estilos fuera de las queries @media y @supports.
</p>

<p>
La regla @at-root admite otros dos valores especiales. El valor rule se refiere a las reglas CSS normales, por lo que @at-root (without: rule) es equivalente a @at-root sin ninguna query. Por su parte, la regla @at-root (without: all) significa que los estilos deben sacarse de cualquier directiva o regla CSS.
</p>

<p>
Si en vez de indicar las directivas o reglas CSS que se excluyen quieres indicar explícitamente las que se inlcuyen, utiliza with en vez de without. Así por ejemplo, los estilos @at-root (with: rule) se moverán fuera de cualquier directiva pero mantendrán todas las reglas CSS.
</p>
</div>
</div>
</div>

<div id="outline-container-org5771d55" class="outline-3">
<h3 id="org5771d55">La regla @debug</h3>
<div class="outline-text-3" id="text-org5771d55">
<p>
La regla @debug muestra por la consola el valor de la expresión SassScript indicada. Se trata de una regla útil para depurar hojas de estilos muy complejas y que utilizan expresiones SassScript muy avanzadas. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@debug</span> 10em + 12em;
</pre>
</div>

<p>
El código anterior mostraría en la consola el siguiente mensaje:
</p>

<div class="org-src-container">
<pre class="src src-sh">Line 1 DEBUG: 22em
</pre>
</div>
</div>
</div>

<div id="outline-container-org671e491" class="outline-3">
<h3 id="org671e491">La regla @warn</h3>
<div class="outline-text-3" id="text-org671e491">
<p>
La regla @warn muestra el valor de una expresió SaasScript en forma de mensaje de error. Se trata de una regla muy útil para que los creadores de las librerías avisen a los diseñadores sobre el uso de características que se han declarado obsoletas. También sirve para mostrar errores en el uso de mixins que Sass ha podido corregir automáticamente. Existen dos diferencias principales entre @warn y @debug:
</p>

<ol class="org-ol">
<li>Puedes desactivar los mensajes de error con la opción <b>&#x2013;quiet</b> de la línea de comandos  o con la opción de configuración :quiet de Sass</li>
<li>Los mensajes de error de @warn también se incluyen en la hoja de estilos generada para que el usuario pueda ver tanto los errores como el lugar exacto en el que se producen.</li>
</ol>

<p>
Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">adjust-location</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$x</span>, <span class="org-variable-name">$y</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@if</span> unitless<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$x</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-builtin">@warn</span> <span class="org-string">"Assuming #{$x} to be in pixels"</span>;
    <span class="org-variable-name">$x</span>: 1px * <span class="org-variable-name">$x</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-builtin">@if</span> unitless<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$y</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-builtin">@warn</span> <span class="org-string">"Assuming #{$y} to be in pixels"</span>;
    <span class="org-variable-name">$y</span>: 1px * <span class="org-variable-name">$y</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-css-property">position</span>: relative; <span class="org-css-property">left</span>: <span class="org-variable-name">$x</span>; <span class="org-css-property">top</span>: <span class="org-variable-name">$y</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgadcb461" class="outline-2">
<h2 id="orgadcb461">Directivas de control y expresiones</h2>
<div class="outline-text-2" id="text-orgadcb461">
<p>
SassScript define algunas directivas de control básicas y expresiones para incluir estilos solamente si se cumplen determinadas condiciones o para incluir el mismo estilo varias veces con ligeras variaciones.
</p>

<p>
<b>NOTA: Las directivas de control son una característica muy avanzada que rara vez se utiliza directamente en las hojas de estilos. Sin embargo, son muy útiles para definir mixins y otras características avanzadas de librerías como Compass.</b>
</p>
</div>

<div id="outline-container-org42e702f" class="outline-3">
<h3 id="org42e702f">La función if()</h3>
<div class="outline-text-3" id="text-org42e702f">
<p>
La functión if() permite tomar decisiones para que una hoja de estilos incluya unos u otros estilos en función de unas determinadas condiciones. La función if() solamente evalúa el argumento que corresponde al valor que va a devolver, por lo que en el otro valor puedes hacer referencia a variables que no existen o realizar cálculos que en circunstancias normales causarían algún error (como por ejemplo dividir por cero).
</p>
</div>
</div>

<div id="outline-container-org306c919" class="outline-3">
<h3 id="org306c919">La directiva @if</h3>
<div class="outline-text-3" id="text-org306c919">
<p>
La directiva @if evalúa una expresión SassScript y solamente incluye los estilos definidos en su interior si la expresión devuelve un valor distinto a false o null. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@if</span> 1 + 1 == 2 <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">border</span>: 1px solid;  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-builtin">@if</span> 5 &lt; 3      <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">border</span>: 2px dotted; <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-builtin">@if</span> null       <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">border</span>: 3px double; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código anterior compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: 1px solid;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
La directiva @if puede ir seguida de una o más directivas @else if y una directiva @else. Si la expresión evaluada por @if es false o null, Sass evalúa por orden el resto de directivas @else if hasta que alguna no devuelva false o null. Si ninguna directiva @else if llega a ejecutarse, se ejecuta la directiva @else si existe. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$type</span>: monster;
<span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@if</span> <span class="org-variable-name">$type</span> == ocean <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="custom-3">blue</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-builtin">@else</span> if <span class="org-variable-name">$type</span> == matador <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="custom-2">red</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-builtin">@else</span> if <span class="org-variable-name">$type</span> == monster <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="custom-1">green</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span> <span class="org-builtin">@else</span> <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="custom">black</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto va a compilar en: 
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">green</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
