doc/html/sass.html

<div id="outline-container-org024e330" class="outline-3">
<h3 id="org024e330">La directiva @for</h3>
<div class="outline-text-3" id="text-org024e330">
<p>
La directiva @for muestra repetidamente un conjunto de estilos. En cada repetición se utiliza el valor de una variable de tipo contador para ajustar el resultado mostrado. La directiva puede utilizar dos sintaxis: @for $var from &lt;inicio&gt; through &lt;final&gt; and @for $var from &lt;inicio&gt; to &lt;final&gt;.
</p>

<p>
La diferencia entre las dos sintaxis es el uso de las palabras clave through o to. El valor $var puede ser cualquier variable, mientras que &lt;inicio&gt; y &lt;final&gt; son expresiones SassScript que deben devolver números enteros. Cuando el valor de &lt;inicio&gt; es mayor que el de &lt;final&gt; el valor del contador se decrementa en vez de incrementarse.
</p>

<p>
En cada repetición del bucle, la directiva @for asigna a la variable $var el valor del contador y repite los estilos utilizando el nuevo valor de $var. En la sintaxis from &#x2026; through, los estilos se repiten desde &lt;inicio&gt; hasta &lt;final&gt;, ambos inclusive. Por su parte, en la sintaxis from &#x2026; to los estilos se repiten desde &lt;inicio&gt; hasta &lt;final&gt;, sin incluir este último. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@for</span> <span class="org-variable-name">$i</span> from 1 through 3 <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.item-#</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">{</span></span><span class="org-variable-name">$i</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">}</span></span><span class="org-css-selector"> </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">width</span>: 2em * <span class="org-variable-name">$i</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compilará en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.item-1 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 2em;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.item-2 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 4em;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.item-3 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 6em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org30e1ace" class="outline-3">
<h3 id="org30e1ace">La directiva @each</h3>
<div class="outline-text-3" id="text-org30e1ace">
<p>
La sintaxis habitual de la directiva @each es la siguiente @each $var in &lt;lista o mapa&gt;. El valor $var puede ser cualquier variable y &lt;lista o mapa&gt; es una expresión <b>SassScript*</b> que devuelve una lista o un mapa.
</p>

<p>
El funcionamiento de @each es el siguiente: se recorre toda la lista o mapa y en cada iteración, se asigna un valor diferente a la variable $var antes de compilar los estilos. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@each</span> <span class="org-variable-name">$animal</span> in puma, sea-slug, egret, salamander <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.#</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">{</span></span><span class="org-variable-name">$animal</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">}</span></span><span class="org-css-selector">-icon </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">'/images/#{$animal}.png'</span><span class="org-rainbow-delimiters-depth-3">)</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.puma-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/puma.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.sea-slug-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/sea-slug.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.egret-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/egret.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.salamander-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/salamander.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>

<div id="outline-container-org991a330" class="outline-4">
<h4 id="org991a330">Asignación múltiple</h4>
<div class="outline-text-4" id="text-org991a330">
<p>
La directiva @each también puede utilizar varias variables de forma simultánea, como por ejemplo: @each $var1, $var2, &#x2026; in &lt;lista&gt;. Si &lt;lista&gt; es una lista formada por listas, a cada variable se le asigna un elemento de cada sublista. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@each</span> <span class="org-variable-name">$animal</span>, <span class="org-variable-name">$color</span>, <span class="org-variable-name">$cursor</span> in <span class="org-rainbow-delimiters-depth-1">(</span>puma, <span class="custom-2">black</span>, default<span class="org-rainbow-delimiters-depth-1">)</span>,
                                  <span class="org-rainbow-delimiters-depth-1">(</span>sea-slug, <span class="custom-1">blue</span>, pointer<span class="org-rainbow-delimiters-depth-1">)</span>,
                                  <span class="org-rainbow-delimiters-depth-1">(</span>egret, <span class="custom">white</span>, move<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.#</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">{</span></span><span class="org-variable-name">$animal</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">}</span></span><span class="org-css-selector">-icon </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">'/images/#{$animal}.png'</span><span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-css-property">border</span>: 2px solid <span class="org-variable-name">$color</span>;
    <span class="org-css-property">cursor</span>: <span class="org-variable-name">$cursor</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.puma-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/puma.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
  <span class="org-css-property">border</span>: 2px solid <span class="custom-2">black</span>;
  <span class="org-css-property">cursor</span>: default;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.sea-slug-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/sea-slug.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
  <span class="org-css-property">border</span>: 2px solid <span class="custom-1">blue</span>;
  <span class="org-css-property">cursor</span>: pointer;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.egret-icon </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">'/images/egret.png'</span><span class="org-rainbow-delimiters-depth-2">)</span>;
  <span class="org-css-property">border</span>: 2px solid <span class="custom">white</span>;
  <span class="org-css-property">cursor</span>: move;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Como los mapas se consideran listas formadas por pares clave: valor, también en este caso se puede utilizar la asignación múltiple. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@each</span> <span class="org-variable-name">$header</span>, <span class="org-variable-name">$size</span> in <span class="org-rainbow-delimiters-depth-1">(</span>h1: 2em, h2: 1.5em, h3: 1.2em<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">#</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">{</span></span><span class="org-variable-name">$header</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">}</span></span><span class="org-css-selector"> </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">font-size</span>: <span class="org-variable-name">$size</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass compilará en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">h1 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 2em;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">h2 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 1.5em;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">h3 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 1.2em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>
