org/sass.org
** La directiva @while

La directiva @while toma una expresión SassScript y repite indefinidamente los estilos hasta que la expresión da como resultado false. Aunque esta directiva se usa muy poco, se puede utilizar para crear bucles más avanzados que los que se crean con la directiva @for. Ejemplo:

#+begin_src scss
$i: 6;
@while $i > 0 {
  .item-#{$i} { width: 2em * $i; }
  $i: $i - 2;
}
#+end_src

Esto compilará en:

#+begin_src css
.item-6 {
  width: 12em;
}
 
.item-4 {
  width: 8em;
}
 
.item-2 {
  width: 4em;
}
#+end_src

* Directivas mixin

Los /mixins/ permiten definir estilos reutilizables en toda la hoja de estilos sin tener que recurrir a clases CSS no semánticas tipo .float-left. Los /mixins/ también pueden contener reglas CSS y cualquier otro elemento definido por Sass. Los mixins incluso admiten el uso de argumentos, como si fueran funciones, para poder modificar su comportamiento y ofrecer así una mayor flexibilidad.

** Definiendo mixins con la directiva @mixin

Los mixins se definen con la directiva @mixin seguida del nombre del mixin (y opcionalmente una lista de argumentos) y seguida por el bloque de contenidos que definen los estilos del mixin. El siguiente ejemplo define un mixin sin argumentos llamado large-text:

#+begin_src scss
@mixin large-text {
  font: {
    family: Arial;
    size: 20px;
    weight: bold;
  }
  color: #ff0000;
}
#+end_src

Además de estilos, los mixins también pueden contener selectores, incluso con referencias al selector padre. Ejemplo:

#+begin_src scss
@mixin clearfix {
  display: inline-block;
  &:after {
    content: ".";
    display: block;
    height: 0;
    clear: both;
    visibility: hidden;
  }
  * html & { height: 1px }
}
#+end_src

** Incluyendo mixins con @include

Los mixins se incluyen en las hojas de estilos mediante la directiva @include seguida del nombre del mixin y opcionalmente por una lista de argumentos. El resultado es que todos los estilos definidos por el mixin se incluyen en el mismo punto en el que se llama al mixin. Ejemplo:

#+begin_src scss
.page-title {
  @include large-text;
  padding: 4px;
  margin-top: 10px;
}
#+end_src

Esto compila en:

#+begin_src css
.page-title {
  font-family: Arial;
  font-size: 20px;
  font-weight: bold;
  color: #ff0000;
  padding: 4px;
  margin-top: 10px;
}
#+end_src

Los mixins también se pueden incluir en el nivel jerárquico superior de la hoja de estilos, es decir, fuera de cualquier selector o regla. Obviamente, estos mixins no pueden incluir ninguna referencia al selector padre, ya que se produciría un error. Ejemplo:

#+begin_src scss
@mixin silly-links {
  a {
    color: blue;
    background-color: red;
  }
}
 
@include silly-links;
#+end_src

Esto se compila de la siguiente manera:

#+begin_src css
a {
  color: blue;
  background-color: red;
}
#+end_src

Los mixins también pueden incluir en su interior otros mixins. Ejemplo:

#+begin_src scss
@mixin compound {
  @include highlighted-background;
  @include header-text;
}
 
@mixin highlighted-background { background-color: #fc0; }
@mixin header-text { font-size: 20px; }
#+end_src

Aunque no es muy habitual, los mixins también pueden incluirse a sí mismos de manera recursiva. En las versiones de Sass anteriores a la 3.3 esta recursividad no estaba permitida.

