doc/html/sass.html

<div id="outline-container-org9c165f0" class="outline-3">
<h3 id="org9c165f0">La directiva @while</h3>
<div class="outline-text-3" id="text-org9c165f0">
<p>
La directiva @while toma una expresión SassScript y repite indefinidamente los estilos hasta que la expresión da como resultado false. Aunque esta directiva se usa muy poco, se puede utilizar para crear bucles más avanzados que los que se crean con la directiva @for. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$i</span>: 6;
<span class="org-builtin">@while</span> <span class="org-variable-name">$i</span> &gt; 0 <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">.item-#</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">{</span></span><span class="org-variable-name">$i</span><span class="org-css-selector"><span class="org-rainbow-delimiters-depth-2">}</span></span><span class="org-css-selector"> </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">width</span>: 2em * <span class="org-variable-name">$i</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-variable-name">$i</span>: <span class="org-variable-name">$i</span> - 2;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compilará en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.item-6 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 12em;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.item-4 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 8em;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.item-2 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 4em;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org01c0b88" class="outline-2">
<h2 id="org01c0b88">Directivas mixin</h2>
<div class="outline-text-2" id="text-org01c0b88">
<p>
Los <i>mixins</i> permiten definir estilos reutilizables en toda la hoja de estilos sin tener que recurrir a clases CSS no semánticas tipo .float-left. Los <i>mixins</i> también pueden contener reglas CSS y cualquier otro elemento definido por Sass. Los mixins incluso admiten el uso de argumentos, como si fueran funciones, para poder modificar su comportamiento y ofrecer así una mayor flexibilidad.
</p>
</div>

<div id="outline-container-org474107a" class="outline-3">
<h3 id="org474107a">Definiendo mixins con la directiva @mixin</h3>
<div class="outline-text-3" id="text-org474107a">
<p>
Los mixins se definen con la directiva @mixin seguida del nombre del mixin (y opcionalmente una lista de argumentos) y seguida por el bloque de contenidos que definen los estilos del mixin. El siguiente ejemplo define un mixin sin argumentos llamado large-text:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> large-text <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font</span>: <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">family</span>: Arial;
    <span class="org-css-property">size</span>: 20px;
    <span class="org-css-property">weight</span>: bold;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-css-property">color</span>: <span class="custom">#ff0000</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Además de estilos, los mixins también pueden contener selectores, incluso con referencias al selector padre. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> clearfix <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">display</span>: inline-block;
  <span class="org-css-selector">&amp;:after </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">content</span>: <span class="org-string">"."</span>;
    <span class="org-css-property">display</span>: block;
    <span class="org-css-property">height</span>: 0;
    <span class="org-css-property">clear</span>: both;
    <span class="org-css-property">visibility</span>: hidden;
  <span class="org-rainbow-delimiters-depth-2">}</span>
  <span class="org-css-selector">* html &amp; </span><span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">height</span>: 1px <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d6901c" class="outline-3">
<h3 id="org8d6901c">Incluyendo mixins con @include</h3>
<div class="outline-text-3" id="text-org8d6901c">
<p>
Los mixins se incluyen en las hojas de estilos mediante la directiva @include seguida del nombre del mixin y opcionalmente por una lista de argumentos. El resultado es que todos los estilos definidos por el mixin se incluyen en el mismo punto en el que se llama al mixin. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">.page-title </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@include</span> large-text;
  <span class="org-css-property">padding</span>: 4px;
  <span class="org-css-property">margin-top</span>: 10px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.page-title </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-family</span>: Arial;
  <span class="org-css-property">font-size</span>: 20px;
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">color</span>: <span class="custom">#ff0000</span>;
  <span class="org-css-property">padding</span>: 4px;
  <span class="org-css-property">margin-top</span>: 10px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Los mixins también se pueden incluir en el nivel jerárquico superior de la hoja de estilos, es decir, fuera de cualquier selector o regla. Obviamente, estos mixins no pueden incluir ninguna referencia al selector padre, ya que se produciría un error. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> silly-links <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="custom-1">blue</span>;
    <span class="org-css-property">background-color</span>: <span class="custom">red</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-builtin">@include</span> silly-links;
</pre>
</div>

<p>
Esto se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">a </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">blue</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">red</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Los mixins también pueden incluir en su interior otros mixins. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> compound <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@include</span> highlighted-background;
  <span class="org-builtin">@include</span> header-text;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-builtin">@mixin</span> highlighted-background <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">background-color</span>: <span class="custom">#fc0</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-builtin">@mixin</span> header-text <span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">font-size</span>: 20px; <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Aunque no es muy habitual, los mixins también pueden incluirse a sí mismos de manera recursiva. En las versiones de Sass anteriores a la 3.3 esta recursividad no estaba permitida.
</p>
</div>
</div>
