doc/html/sass.html

<div id="outline-container-orga3dd9ed" class="outline-3">
<h3 id="orga3dd9ed">Argumentos</h3>
<div class="outline-text-3" id="text-orga3dd9ed">
<p>
Los argumentos de los mixins pueden estar formados por cualquier expresión SassScript. Estos argumentos están disponibles en el interior del mixin en forma de variables.
</p>

<p>
Cuando se define un mixin, los argumentos se definen como una serie de variables separadas por comas, y todo ello encerrado entre paréntesis. Después, cuando se utiliza un mixin deben pasarse los valores de los argumentos en ese mismo orden. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">sexy-border</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$color</span>, <span class="org-variable-name">$width</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="org-variable-name">$color</span>;
    <span class="org-css-property">width</span>: <span class="org-variable-name">$width</span>;
    <span class="org-css-property">style</span>: dashed;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-builtin">@include</span> sexy-border<span class="org-rainbow-delimiters-depth-2">(</span><span class="custom">blue</span>, 1in<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Este código se compila como:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-color</span>: <span class="custom">blue</span>;
  <span class="org-css-property">border-width</span>: 1in;
  <span class="org-css-property">border-style</span>: dashed;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Los mixins también pueden especificar valores por defecto para sus argumentos. De esta manera, si al llamar a un mixin no se pasa el valor de ese argumento, se utiliza en su lugar el valor por defecto. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">sexy-border</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$color</span>, <span class="org-variable-name">$width</span>: 1in<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border</span>: <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">color</span>: <span class="org-variable-name">$color</span>;
    <span class="org-css-property">width</span>: <span class="org-variable-name">$width</span>;
    <span class="org-css-property">style</span>: dashed;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-builtin">@include</span> sexy-border<span class="org-rainbow-delimiters-depth-2">(</span><span class="custom">blue</span><span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">h1 </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-builtin">@include</span> sexy-border<span class="org-rainbow-delimiters-depth-2">(</span><span class="custom">blue</span>, 2in<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Esto compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-color</span>: <span class="custom">blue</span>;
  <span class="org-css-property">border-width</span>: 1in;
  <span class="org-css-property">border-style</span>: dashed;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">h1 </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">border-color</span>: <span class="custom">blue</span>;
  <span class="org-css-property">border-width</span>: 2in;
  <span class="org-css-property">border-style</span>: dashed;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd58a30b" class="outline-3">
<h3 id="orgd58a30b">Argumentos con nombre</h3>
<div class="outline-text-3" id="text-orgd58a30b">
<p>
Cuando se utiliza un mixin también es posible indicar el nombre de sus argumentos:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">p </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-builtin">@include</span> sexy-border<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$color</span>: <span class="custom">blue</span><span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">h1 </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-builtin">@include</span> sexy-border<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$color</span>: <span class="custom">blue</span>, <span class="org-variable-name">$width</span>: 2in<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Aunque esta sintaxis es menos concisa que la anterior, hace que las hojas de estilos sean más fáciles de leer. Además permite que los mixins tengan interfaces más flexibles y fáciles de usar, aún cuando incluyan muchos argumentos.
</p>

<p>
Los argumentos con nombre se pueden pasar en cualquier orden y puedes omitir los que tienen un valor por defecto. Además, como los argumentos con nombre en realidad son nombres de variables, puedes utilizar indistintamente guiones medios y bajos.
</p>
</div>
</div>
