doc/html/sass.html

<div id="outline-container-org884c3f6" class="outline-3">
<h3 id="org884c3f6">Argumentos variables</h3>
<div class="outline-text-3" id="text-org884c3f6">
<p>
En ocasiones es necesario que un mixin acepte un número indeterminado de argumentos. Si por ejemplo tienes un mixin que añade sombras a los elementos HTML, es preciso que ese mixin acepte cualquier número de sombras como argumentos. Por eso Sass soporta la creación de mixins con un número variable de argumentos.
</p>

<p>
Para indicar que un mixin tiene un número variable de argumentos, después del último argumento se añaden tres puntos (&#x2026;). Esto hará que todos los argumentos sobrantes se guarden como una lista en ese último argumento. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">box-shadow</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$shadows</span>...<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-proprietary-property">-moz-box-shadow</span>: <span class="org-variable-name">$shadows</span>;
  <span class="org-css-proprietary-property">-webkit-box-shadow</span>: <span class="org-variable-name">$shadows</span>;
  <span class="org-css-property">box-shadow</span>: <span class="org-variable-name">$shadows</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.shadows </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@include</span> box-shadow<span class="org-rainbow-delimiters-depth-2">(</span>0px 4px 5px <span class="custom-1">#666</span>, 2px 6px 10px <span class="custom">#999</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Este código da como resultado de la compilación:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.shadows </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-proprietary-property">-moz-box-shadow</span>: 0px 4px 5px <span class="custom-1">#666</span>, 2px 6px 10px <span class="custom">#999</span>;
  <span class="org-css-proprietary-property">-webkit-box-shadow</span>: 0px 4px 5px <span class="custom-1">#666</span>, 2px 6px 10px <span class="custom">#999</span>;
  <span class="org-css-property">box-shadow</span>: 0px 4px 5px <span class="custom-1">#666</span>, 2px 6px 10px <span class="custom">#999</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Los argumentos variables también contienen todos los argumentos con nombre pasados al mixin o función. Puedes acceder a ellos mediante la función keywords($args), que devuelve un mapa de cadenas de texto en las que el nombre de la variable no contiene el carácter $.
</p>

<p>
Los argumentos variables también se pueden utilizar cuando se llama a un mixin. Utilizando la misma sintaxis de los tres puntos (&#x2026;) puedes expandir una lista de valores para pasar cada elemento de la lista como si fuera un argumento. Cuando esta sintaxis se utiliza con mapas, cada par clave: valor se transforma en un argumento con el nombre clave. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">colors</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$text</span>, <span class="org-variable-name">$background</span>, <span class="org-variable-name">$border</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="org-variable-name">$text</span>;
  <span class="org-css-property">background-color</span>: <span class="org-variable-name">$background</span>;
  <span class="org-css-property">border-color</span>: <span class="org-variable-name">$border</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-variable-name">$values</span>: <span class="custom-2">#ff0000</span>, <span class="custom-1">#00ff00</span>, <span class="custom">#0000ff</span>;
<span class="org-css-selector">.primary </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@include</span> colors<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$values</span>...<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-variable-name">$value-map</span>: <span class="org-rainbow-delimiters-depth-1">(</span>text: <span class="custom-1">#00ff00</span>, background: <span class="custom">#0000ff</span>, border: <span class="custom-2">#ff0000</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-css-selector">.secondary </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@include</span> colors<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$value-map</span>...<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>

<p>
Esto compila a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.primary </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-2">#ff0000</span>;
  <span class="org-css-property">background-color</span>: <span class="custom-1">#00ff00</span>;
  <span class="org-css-property">border-color</span>: <span class="custom">#0000ff</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.secondary </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom">#0000ff</span>;
  <span class="org-css-property">background-color</span>: <span class="custom-2">#ff0000</span>;
  <span class="org-css-property">border-color</span>: <span class="custom-1">#00ff00</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
También es posible pasar una lista de argumentos y un mapa siempre que la lista se pase primero, como por ejemplo: @include colors($values&#x2026;, $map&#x2026;).
</p>

<p>
Los argumentos variables pueden servir por ejemplo para crear un mixin que modifique otro mixin existente añadiendo nuevos estilos. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> <span class="org-function-name">wrapped-stylish-mixin</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$args</span>...<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-builtin">@include</span> stylish-mixin<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$args</span>...<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.stylish </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">El argumento $width se pasa con nombre al mixin "stylish-mixin"</span>
  <span class="org-builtin">@include</span> wrapped-stylish-mixin<span class="org-rainbow-delimiters-depth-2">(</span><span class="custom">#00ff00</span>, <span class="org-variable-name">$width</span>: 100px<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd1bd81" class="outline-3">
<h3 id="orgbd1bd81">Pasando bloques de contenidos a los mixins</h3>
<div class="outline-text-3" id="text-orgbd1bd81">
<p>
A los mixins también se les puede pasar un bloque entero de reglas CSS. Este contenido se incluirá en el lugar donde el mixin haya definido la directiva @content. Gracias a esta característica es posible abstraer ciertas partes de la definición de los selectores y directivas. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-builtin">@mixin</span> apply-to-ie6-only <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">* html </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-builtin">@content</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-builtin">@include</span> apply-to-ie6-only <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-selector">#logo </span><span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">background-image</span>: url<span class="org-default">(</span><span class="org-string">/logo.gif</span><span class="org-default">)</span>;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Esto compila en:
</p>

<div class="org-src-container">
<pre class="src src-css"> <span class="org-css-selector">html #logo </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-image</span>: url<span class="org-default">(</span><span class="org-string">/logo.gif</span><span class="org-default">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Estos mixins también se pueden definir mediante los siguientes atajos:
</p>

<div class="org-src-container">
<pre class="src src-scss">    <span class="org-builtin">@content</span>

+apply-to-ie6-only
  #logo
    <span class="org-css-property">background-image</span>: url<span class="org-default">(</span><span class="org-string">/logo.gif</span><span class="org-default">)</span>
</pre>
</div>


<p>
<b>NOTA: Cuando se incluye la directiva @content más de una vez o se incluye dentro de un bucle, los contenidos se repiten para cada aparición de @content.</b>
</p>
</div>
