doc/html/sass.html
<div id="outline-container-orgf09ed45" class="outline-4">
<h4 id="orgf09ed45">Contexto variables y bloques contenidos</h4>
<div class="outline-text-4" id="text-orgf09ed45">
<p>
Los bloques de contenidos pasados a los mixins se evalúan en el contexto en el que están definidos, no en el contexto del mixin. Esto significa que los bloques de contenidos no pueden utilizar las variables locales definidas en el mixin. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$color</span>: <span class="custom-1">white</span>;
<span class="org-builtin">@mixin</span> <span class="org-function-name">colors</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$color</span>: <span class="custom">blue</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-color</span>: <span class="org-variable-name">$color</span>;
  <span class="org-builtin">@content</span>;
  <span class="org-css-property">border-color</span>: <span class="org-variable-name">$color</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">.colors </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@include</span> colors <span class="org-rainbow-delimiters-depth-2">{</span> <span class="org-css-property">color</span>: <span class="org-variable-name">$color</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Que compila a:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">.colors </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">background-color</span>: <span class="custom-1">blue</span>;
  <span class="org-css-property">color</span>: <span class="custom">white</span>;
  <span class="org-css-property">border-color</span>: <span class="custom-1">blue</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
De esta forma, las variables que se utilizan en los bloques que se pasan a los mixins siempre hacen referencia a las variables definidas alrededor de ese bloque o directamente en el nivel jerárquico superior de la hoja de estilos. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-variable-name">$sidebar-width</span>: 300px;
  <span class="org-css-property">width</span>: <span class="org-variable-name">$sidebar-width</span>;
  <span class="org-builtin">@include</span> smartphone <span class="org-rainbow-delimiters-depth-2">{</span>
    <span class="org-css-property">width</span>: <span class="org-variable-name">$sidebar-width</span> / 3;
  <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org9f30160" class="outline-2">
<h2 id="org9f30160">Directivas de función</h2>
<div class="outline-text-2" id="text-org9f30160">
<p>
Al margen de las funciones propias definidas por Sass, también es posible definir funciones propias para que puedas utilizarlas en tus hojas de estilos. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-variable-name">$grid-width</span>: 40px;
<span class="org-variable-name">$gutter-width</span>: 10px;

<span class="org-builtin">@function</span> grid-width<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-variable-name">$n</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-builtin">@return</span> <span class="org-variable-name">$n</span> * <span class="org-variable-name">$grid-width</span> + <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$n</span> - 1<span class="org-rainbow-delimiters-depth-2">)</span> * <span class="org-variable-name">$gutter-width</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">#sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">width</span>: grid-width<span class="org-rainbow-delimiters-depth-2">(</span>5<span class="org-rainbow-delimiters-depth-2">)</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El código Sass anterior se compila de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 240px;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Al igual que sucede con los mixins, las funciones pueden acceder a cualquier variable global y también pueden aceptar argumentos. El contenido de una función puede estar formado por varias líneas, pero siempre debe acabar con una directiva de tipo @return para devolver el resultado de su ejecución.
</p>

<p>
Las funciones propias también admiten el uso de argumentos con nombre. De hecho, la función del ejemplo anterior también se puede utilizar de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-scss"><span class="org-css-selector">#sidebar </span><span class="org-rainbow-delimiters-depth-1">{</span> width grid-width<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-variable-name">$n</span>: 5<span class="org-rainbow-delimiters-depth-2">)</span>;<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Para evitar posibles conflictos en el nombre de las funciones, es aconsejable añadirles un prefijo. Así además los usuarios sabrán claramente que esas funciones no forman parte ni de Sass ni de CSS. Una buena idea consiste en utilizar como prefijo tu nombre o el de tu empresa. Si trabajas por ejemplo para la empresa ACME S.A., la función anterior podría haberse llamado -acme-grid-width.
</p>

<p>
Por último, las funciones propias también soportan el uso de un número variable de argumentos, tal y como se explicó en el capítulo de los mixins.
</p>
</div>
</div>

<div id="outline-container-org1049e80" class="outline-2">
<h2 id="org1049e80">Formato de salida</h2>
<div class="outline-text-2" id="text-org1049e80">
<p>
El formato utilizado por Sass para compilar los archivos CSS no sólo es adecuado sino que refleja bien la estructura del documento. No obstante, como los gustos (y las necesidades) de los diseñadores/as son muy particulares, Sass permite configurar cómo se generan los archivos.
</p>

<p>
En concreto, Sass permite elegir entre cuatro formatos diferentes mediante la opción de configuración :style o mediante la opción &#x2013;style de la consola de comandos.
</p>
</div>

<div id="outline-container-org1d61419" class="outline-3">
<h3 id="org1d61419">Formato :nested</h3>
<div class="outline-text-3" id="text-org1d61419">
<p>
Este es el estilo por defecto de Sass, que indenta y anida todos los selectores y estilos para reflejar fielmente la estructura del archivo Sass original. Cada propiedad se muestra en su propia línea y cada regla se indenta tanto como sea necesario en función de su anidamiento. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">#fff</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#000</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
  <span class="org-css-selector">#main p </span><span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-css-property">width</span>: 10em; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.huge </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 10em;
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">text-decoration</span>: underline; <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
El estilo nested es muy útil cuando se generan hojas de estilos CSS muy complejas, ya que de un vistazo puedes entender toda su estructura.
</p>
</div>
</div>

<div id="outline-container-org13f9301" class="outline-3">
<h3 id="org13f9301">El formato :expanded</h3>
<div class="outline-text-3" id="text-org13f9301">
<p>
Este estilo es más parecido al que utilizaría un diseñador/a al crear manualmente la hoja de estilos CSS. Cada propiedad y cada regla se muestran en una nueva línea, pero las reglas no se indentan de ninguna manera especial. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">color</span>: <span class="custom-1">#fff</span>;
  <span class="org-css-property">background-color</span>: <span class="custom">#000</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main p </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">width</span>: 10em;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.huge </span><span class="org-rainbow-delimiters-depth-1">{</span>
  <span class="org-css-property">font-size</span>: 10em;
  <span class="org-css-property">font-weight</span>: bold;
  <span class="org-css-property">text-decoration</span>: underline;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
