doc/html/sass.html

<div id="outline-container-org76696a7" class="outline-3">
<h3 id="org76696a7">El formato :compact</h3>
<div class="outline-text-3" id="text-org76696a7">
<p>
Este estilo ocupa menos líneas que los estilos nested o expanded y prioriza los selectores por encima de las propiedades. De hecho, cada regla CSS solamente ocupa una línea, donde se definen todas las propiedades. Las reglas anidadas se muestran seguidas unas de otras (sin ningún salto de línea) y solamente se añade una línea en blanco para separar los grupos de reglas CSS. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">color</span>: <span class="custom-1">#fff</span>; <span class="org-css-property">background-color</span>: <span class="custom">#000</span>; <span class="org-rainbow-delimiters-depth-1">}</span>
<span class="org-css-selector">#main p </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">width</span>: 10em; <span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-css-selector">.huge </span><span class="org-rainbow-delimiters-depth-1">{</span> <span class="org-css-property">font-size</span>: 10em; <span class="org-css-property">font-weight</span>: bold; <span class="org-css-property">text-decoration</span>: underline; <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org37c8f9c" class="outline-3">
<h3 id="org37c8f9c">El formato :compressed</h3>
<div class="outline-text-3" id="text-org37c8f9c">
<p>
Este estilo es el más conciso de todos porque no añade ningún espacio en blanco, salvo el que sea estrictamente necesario para separar los selectores. El único salto de línea que se añade es el del final del archivo. Este formato también realiza otras optimizaciones y compresiones en valores como los colores. Aunque no está pensado como formato para que lo lean los humanos, puede ser muy útil para comprimir al máximo las hojas de estilos CSS antes de servirlas a los usuarios. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#main</span><span class="org-rainbow-delimiters-depth-1">{</span><span class="org-css-property">color</span>:<span class="custom-1">#fff</span>;<span class="org-css-property">background-color</span>:<span class="custom">#000</span><span class="org-rainbow-delimiters-depth-1">}</span>#main p<span class="org-rainbow-delimiters-depth-1">{</span><span class="org-css-property">width</span>:10em<span class="org-rainbow-delimiters-depth-1">}</span>.huge<span class="org-rainbow-delimiters-depth-1">{</span><span class="org-css-property">font-size</span>:10em;<span class="org-css-property">font-weight</span>:bold;<span class="org-css-property">text-decoration</span>:underline<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5918c1d" class="outline-2">
<h2 id="org5918c1d">Extendiendo Sass</h2>
<div class="outline-text-2" id="text-org5918c1d">
<p>
Sass proporciona una serie de características adicionales para usuarios que tengan requerimientos muy especiales y dispongan de conocimientos avanzados de Ruby.
</p>
</div>

<div id="outline-container-org49628eb" class="outline-3">
<h3 id="org49628eb">Definiendo funciones propias para Sass</h3>
<div class="outline-text-3" id="text-org49628eb">
<p>
Utilizando la API de Ruby es posible definir tus propias funciones. Consulta la documentación oficial para saber cómo hacerlo.
</p>
</div>
</div>

<div id="outline-container-org49df0aa" class="outline-3">
<h3 id="org49df0aa">Sistemas de caché</h3>
<div class="outline-text-3" id="text-org49df0aa">
<p>
Sass cachea la compilación de los archivos Sass o SCSS originales para poder reutilizarlos cuando no se han producido cambios. Por defecto estos archivos se cachean en el directorio indicado por la opción :cache<sub>location</sub>.
</p>

<p>
Si no puedes cachear estos archivos en un directorio o quieres compartirlos entre varios procesos Ruby de diferentes máquinas, puedes crear tu propio sistema de caché y utilizarlo mediante la opción de configuración :cache<sub>store</sub>.
</p>

<p>
Consulta la <a href="http://sass-lang.com/documentation/Sass/CacheStores/Base.html">documentación de la clase CacheStores::Base</a> para conocer todos los detalles sobre cómo crear tu propio sistema de caché.
</p>
</div>
</div>

<div id="outline-container-orgc9173f8" class="outline-3">
<h3 id="orgc9173f8">Importadores propios</h3>
<div class="outline-text-3" id="text-orgc9173f8">
<p>
Los importadores de Sass se encargan de encontrar los archivos Sass adecuados a partir de los valores proporcionados en las directivas @import. Por defecto el código siempre se importa desde algún directorio del sistema de archivos, pero también se puede cargar desde una base de datos o incluso mediante servicios web.
</p>

<p>
Cada importador se encarga de gestionar un tipo diferente de importación. Todos ellos se pueden configurar en la opción de configuración :load<sub>paths</sub> y se pueden utilizar junto a los importadores normales del sistema de archivos.
</p>

<p>
Cuando se resuelve el valor de una directiva @import, Sass recorre todos los importadores registrados hasta encontrar con alguno que pueda importar el valor indicado. Los importadores propios siempre deben heredar de la clase {Sass::Importers::Base}.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Patricio Martínez Cano</p>
<p class="date">Created: 2017-07-27 jue 10:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
